mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xj/common/s6e2c1xj.h
/*******************************************************************************
* MFS Registers MFS14
*   Register Definition
*******************************************************************************/
#define FM_MFS14_CSIO_SMR                         *((volatile  uint8_t*)(0x40038E00UL))
#define FM4_MFS14_CSIO_SMR                        *((volatile  uint8_t*)(0x40038E00UL))
#define FM_MFS14_I2C_SMR                          *((volatile  uint8_t*)(0x40038E00UL))
#define FM4_MFS14_I2C_SMR                         *((volatile  uint8_t*)(0x40038E00UL))
#define FM_MFS14_LIN_SMR                          *((volatile  uint8_t*)(0x40038E00UL))
#define FM4_MFS14_LIN_SMR                         *((volatile  uint8_t*)(0x40038E00UL))
#define FM_MFS14_UART_SMR                         *((volatile  uint8_t*)(0x40038E00UL))
#define FM4_MFS14_UART_SMR                        *((volatile  uint8_t*)(0x40038E00UL))
#define FM_MFS14_CSIO_SCR                         *((volatile  uint8_t*)(0x40038E01UL))
#define FM4_MFS14_CSIO_SCR                        *((volatile  uint8_t*)(0x40038E01UL))
#define FM_MFS14_I2C_IBCR                         *((volatile  uint8_t*)(0x40038E01UL))
#define FM4_MFS14_I2C_IBCR                        *((volatile  uint8_t*)(0x40038E01UL))
#define FM_MFS14_LIN_SCR                          *((volatile  uint8_t*)(0x40038E01UL))
#define FM4_MFS14_LIN_SCR                         *((volatile  uint8_t*)(0x40038E01UL))
#define FM_MFS14_UART_SCR                         *((volatile  uint8_t*)(0x40038E01UL))
#define FM4_MFS14_UART_SCR                        *((volatile  uint8_t*)(0x40038E01UL))
#define FM_MFS14_CSIO_ESCR                        *((volatile  uint8_t*)(0x40038E04UL))
#define FM4_MFS14_CSIO_ESCR                       *((volatile  uint8_t*)(0x40038E04UL))
#define FM_MFS14_I2C_IBSR                         *((volatile  uint8_t*)(0x40038E04UL))
#define FM4_MFS14_I2C_IBSR                        *((volatile  uint8_t*)(0x40038E04UL))
#define FM_MFS14_LIN_ESCR                         *((volatile  uint8_t*)(0x40038E04UL))
#define FM4_MFS14_LIN_ESCR                        *((volatile  uint8_t*)(0x40038E04UL))
#define FM_MFS14_UART_ESCR                        *((volatile  uint8_t*)(0x40038E04UL))
#define FM4_MFS14_UART_ESCR                       *((volatile  uint8_t*)(0x40038E04UL))
#define FM_MFS14_CSIO_SSR                         *((volatile  uint8_t*)(0x40038E05UL))
#define FM4_MFS14_CSIO_SSR                        *((volatile  uint8_t*)(0x40038E05UL))
#define FM_MFS14_I2C_SSR                          *((volatile  uint8_t*)(0x40038E05UL))
#define FM4_MFS14_I2C_SSR                         *((volatile  uint8_t*)(0x40038E05UL))
#define FM_MFS14_LIN_SSR                          *((volatile  uint8_t*)(0x40038E05UL))
#define FM4_MFS14_LIN_SSR                         *((volatile  uint8_t*)(0x40038E05UL))
#define FM_MFS14_UART_SSR                         *((volatile  uint8_t*)(0x40038E05UL))
#define FM4_MFS14_UART_SSR                        *((volatile  uint8_t*)(0x40038E05UL))
#define FM_MFS14_CSIO_RDR                         *((volatile uint16_t*)(0x40038E08UL))
#define FM4_MFS14_CSIO_RDR                        *((volatile uint16_t*)(0x40038E08UL))
#define FM_MFS14_CSIO_TDR                         *((volatile uint16_t*)(0x40038E08UL))
#define FM4_MFS14_CSIO_TDR                        *((volatile uint16_t*)(0x40038E08UL))
#define FM_MFS14_I2C_RDR                          *((volatile uint16_t*)(0x40038E08UL))
#define FM4_MFS14_I2C_RDR                         *((volatile uint16_t*)(0x40038E08UL))
#define FM_MFS14_I2C_TDR                          *((volatile uint16_t*)(0x40038E08UL))
#define FM4_MFS14_I2C_TDR                         *((volatile uint16_t*)(0x40038E08UL))
#define FM_MFS14_LIN_RDR                          *((volatile uint16_t*)(0x40038E08UL))
#define FM4_MFS14_LIN_RDR                         *((volatile uint16_t*)(0x40038E08UL))
#define FM_MFS14_LIN_TDR                          *((volatile uint16_t*)(0x40038E08UL))
#define FM4_MFS14_LIN_TDR                         *((volatile uint16_t*)(0x40038E08UL))
#define FM_MFS14_UART_RDR                         *((volatile uint16_t*)(0x40038E08UL))
#define FM4_MFS14_UART_RDR                        *((volatile uint16_t*)(0x40038E08UL))
#define FM_MFS14_UART_TDR                         *((volatile uint16_t*)(0x40038E08UL))
#define FM4_MFS14_UART_TDR                        *((volatile uint16_t*)(0x40038E08UL))
#define FM_MFS14_CSIO_BGR                         *((volatile uint16_t*)(0x40038E0CUL))
#define FM4_MFS14_CSIO_BGR                        *((volatile uint16_t*)(0x40038E0CUL))
#define FM_MFS14_I2C_BGR                          *((volatile uint16_t*)(0x40038E0CUL))
#define FM4_MFS14_I2C_BGR                         *((volatile uint16_t*)(0x40038E0CUL))
#define FM_MFS14_LIN_BGR                          *((volatile uint16_t*)(0x40038E0CUL))
#define FM4_MFS14_LIN_BGR                         *((volatile uint16_t*)(0x40038E0CUL))
#define FM_MFS14_UART_BGR                         *((volatile uint16_t*)(0x40038E0CUL))
#define FM4_MFS14_UART_BGR                        *((volatile uint16_t*)(0x40038E0CUL))
#define FM_MFS14_I2C_ISBA                         *((volatile  uint8_t*)(0x40038E10UL))
#define FM4_MFS14_I2C_ISBA                        *((volatile  uint8_t*)(0x40038E10UL))
#define FM_MFS14_I2C_ISMK                         *((volatile  uint8_t*)(0x40038E11UL))
#define FM4_MFS14_I2C_ISMK                        *((volatile  uint8_t*)(0x40038E11UL))
#define FM_MFS14_CSIO_FCR                         *((volatile uint16_t*)(0x40038E14UL))
#define FM4_MFS14_CSIO_FCR                        *((volatile uint16_t*)(0x40038E14UL))
#define FM_MFS14_I2C_FCR                          *((volatile uint16_t*)(0x40038E14UL))
#define FM4_MFS14_I2C_FCR                         *((volatile uint16_t*)(0x40038E14UL))
#define FM_MFS14_LIN_FCR                          *((volatile uint16_t*)(0x40038E14UL))
#define FM4_MFS14_LIN_FCR                         *((volatile uint16_t*)(0x40038E14UL))
#define FM_MFS14_UART_FCR                         *((volatile uint16_t*)(0x40038E14UL))
#define FM4_MFS14_UART_FCR                        *((volatile uint16_t*)(0x40038E14UL))
#define FM_MFS14_CSIO_FBYTE1                      *((volatile  uint8_t*)(0x40038E18UL))
#define FM4_MFS14_CSIO_FBYTE1                     *((volatile  uint8_t*)(0x40038E18UL))
#define FM_MFS14_I2C_FBYTE1                       *((volatile  uint8_t*)(0x40038E18UL))
#define FM4_MFS14_I2C_FBYTE1                      *((volatile  uint8_t*)(0x40038E18UL))
#define FM_MFS14_LIN_FBYTE1                       *((volatile  uint8_t*)(0x40038E18UL))
#define FM4_MFS14_LIN_FBYTE1                      *((volatile  uint8_t*)(0x40038E18UL))
#define FM_MFS14_UART_FBYTE1                      *((volatile  uint8_t*)(0x40038E18UL))
#define FM4_MFS14_UART_FBYTE1                     *((volatile  uint8_t*)(0x40038E18UL))
#define FM_MFS14_CSIO_FBYTE2                      *((volatile  uint8_t*)(0x40038E19UL))
#define FM4_MFS14_CSIO_FBYTE2                     *((volatile  uint8_t*)(0x40038E19UL))
#define FM_MFS14_I2C_FBYTE2                       *((volatile  uint8_t*)(0x40038E19UL))
#define FM4_MFS14_I2C_FBYTE2                      *((volatile  uint8_t*)(0x40038E19UL))
#define FM_MFS14_LIN_FBYTE2                       *((volatile  uint8_t*)(0x40038E19UL))
#define FM4_MFS14_LIN_FBYTE2                      *((volatile  uint8_t*)(0x40038E19UL))
#define FM_MFS14_UART_FBYTE2                      *((volatile  uint8_t*)(0x40038E19UL))
#define FM4_MFS14_UART_FBYTE2                     *((volatile  uint8_t*)(0x40038E19UL))
#define FM_MFS14_CSIO_SCSTR0                      *((volatile  uint8_t*)(0x40038E1CUL))
#define FM4_MFS14_CSIO_SCSTR0                     *((volatile  uint8_t*)(0x40038E1CUL))
#define FM_MFS14_I2C_NFCR                         *((volatile  uint8_t*)(0x40038E1CUL))
#define FM4_MFS14_I2C_NFCR                        *((volatile  uint8_t*)(0x40038E1CUL))
#define FM_MFS14_CSIO_SCSTR1                      *((volatile  uint8_t*)(0x40038E1DUL))
#define FM4_MFS14_CSIO_SCSTR1                     *((volatile  uint8_t*)(0x40038E1DUL))
#define FM_MFS14_I2C_EIBCR                        *((volatile  uint8_t*)(0x40038E1DUL))
#define FM4_MFS14_I2C_EIBCR                       *((volatile  uint8_t*)(0x40038E1DUL))
#define FM_MFS14_CSIO_SCSTR32                     *((volatile uint16_t*)(0x40038E20UL))
#define FM4_MFS14_CSIO_SCSTR32                    *((volatile uint16_t*)(0x40038E20UL))
#define FM_MFS14_CSIO_SACSR                       *((volatile uint16_t*)(0x40038E24UL))
#define FM4_MFS14_CSIO_SACSR                      *((volatile uint16_t*)(0x40038E24UL))
#define FM_MFS14_CSIO_STMR                        *((volatile uint16_t*)(0x40038E28UL))
#define FM4_MFS14_CSIO_STMR                       *((volatile uint16_t*)(0x40038E28UL))
#define FM_MFS14_CSIO_STMCR                       *((volatile uint16_t*)(0x40038E2CUL))
#define FM4_MFS14_CSIO_STMCR                      *((volatile uint16_t*)(0x40038E2CUL))
#define FM_MFS14_CSIO_SCSCR                       *((volatile uint16_t*)(0x40038E30UL))
#define FM4_MFS14_CSIO_SCSCR                      *((volatile uint16_t*)(0x40038E30UL))
#define FM_MFS14_CSIO_SCSFR0                      *((volatile  uint8_t*)(0x40038E34UL))
#define FM4_MFS14_CSIO_SCSFR0                     *((volatile  uint8_t*)(0x40038E34UL))
#define FM_MFS14_CSIO_SCSFR1                      *((volatile  uint8_t*)(0x40038E35UL))
#define FM4_MFS14_CSIO_SCSFR1                     *((volatile  uint8_t*)(0x40038E35UL))
#define FM_MFS14_CSIO_SCSFR2                      *((volatile  uint8_t*)(0x40038E38UL))
#define FM4_MFS14_CSIO_SCSFR2                     *((volatile  uint8_t*)(0x40038E38UL))
#define FM_MFS14_CSIO_TBYTE0                      *((volatile  uint8_t*)(0x40038E3CUL))
#define FM4_MFS14_CSIO_TBYTE0                     *((volatile  uint8_t*)(0x40038E3CUL))
#define FM_MFS14_CSIO_TBYTE1                      *((volatile  uint8_t*)(0x40038E3DUL))
#define FM4_MFS14_CSIO_TBYTE1                     *((volatile  uint8_t*)(0x40038E3DUL))
#define FM_MFS14_CSIO_TBYTE2                      *((volatile  uint8_t*)(0x40038E40UL))
#define FM4_MFS14_CSIO_TBYTE2                     *((volatile  uint8_t*)(0x40038E40UL))
#define FM_MFS14_CSIO_TBYTE3                      *((volatile  uint8_t*)(0x40038E41UL))
#define FM4_MFS14_CSIO_TBYTE3                     *((volatile  uint8_t*)(0x40038E41UL))

