mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xj/common/s6e2c1xj.h
#define FM_GPIO_PFR1_AVAILABLE                    1
#define FM4_GPIO_PFR2_AVAILABLE                   1
#define FM_GPIO_PFR2_AVAILABLE                    1
#define FM4_GPIO_PFR3_AVAILABLE                   1
#define FM_GPIO_PFR3_AVAILABLE                    1
#define FM4_GPIO_PFR4_AVAILABLE                   1
#define FM_GPIO_PFR4_AVAILABLE                    1
#define FM4_GPIO_PFR5_AVAILABLE                   1
#define FM_GPIO_PFR5_AVAILABLE                    1
#define FM4_GPIO_PFR6_AVAILABLE                   1
#define FM_GPIO_PFR6_AVAILABLE                    1
#define FM4_GPIO_PFR7_AVAILABLE                   1
#define FM_GPIO_PFR7_AVAILABLE                    1
#define FM4_GPIO_PFR8_AVAILABLE                   1
#define FM_GPIO_PFR8_AVAILABLE                    1
#define FM4_GPIO_PFR9_AVAILABLE                   1
#define FM_GPIO_PFR9_AVAILABLE                    1
#define FM4_GPIO_PFRA_AVAILABLE                   1
#define FM_GPIO_PFRA_AVAILABLE                    1
#define FM4_GPIO_PFRB_AVAILABLE                   1
#define FM_GPIO_PFRB_AVAILABLE                    1
#define FM4_GPIO_PFRC_AVAILABLE                   1
#define FM_GPIO_PFRC_AVAILABLE                    1
#define FM4_GPIO_PFRD_AVAILABLE                   1
#define FM_GPIO_PFRD_AVAILABLE                    1
#define FM4_GPIO_PFRE_AVAILABLE                   1
#define FM_GPIO_PFRE_AVAILABLE                    1
#define FM4_GPIO_PFRF_AVAILABLE                   1
#define FM_GPIO_PFRF_AVAILABLE                    1
#define FM4_GPIO_PZR0_AVAILABLE                   1
#define FM_GPIO_PZR0_AVAILABLE                    1
#define FM4_GPIO_PZR1_AVAILABLE                   1
#define FM_GPIO_PZR1_AVAILABLE                    1
#define FM4_GPIO_PZR2_AVAILABLE                   1
#define FM_GPIO_PZR2_AVAILABLE                    1
#define FM4_GPIO_PZR3_AVAILABLE                   1
#define FM_GPIO_PZR3_AVAILABLE                    1
#define FM4_GPIO_PZR4_AVAILABLE                   1
#define FM_GPIO_PZR4_AVAILABLE                    1
#define FM4_GPIO_PZR5_AVAILABLE                   1
#define FM_GPIO_PZR5_AVAILABLE                    1
#define FM4_GPIO_PZR6_AVAILABLE                   1
#define FM_GPIO_PZR6_AVAILABLE                    1
#define FM4_GPIO_PZR7_AVAILABLE                   1
#define FM_GPIO_PZR7_AVAILABLE                    1
#define FM4_GPIO_PZR8_AVAILABLE                   1
#define FM_GPIO_PZR8_AVAILABLE                    1
#define FM4_GPIO_PZR9_AVAILABLE                   1
#define FM_GPIO_PZR9_AVAILABLE                    1
#define FM4_GPIO_PZRA_AVAILABLE                   1
#define FM_GPIO_PZRA_AVAILABLE                    1
#define FM4_GPIO_PZRB_AVAILABLE                   1
#define FM_GPIO_PZRB_AVAILABLE                    1
#define FM4_GPIO_PZRC_AVAILABLE                   1
#define FM_GPIO_PZRC_AVAILABLE                    1
#define FM4_GPIO_PZRD_AVAILABLE                   1
#define FM_GPIO_PZRD_AVAILABLE                    1
#define FM4_GPIO_PZRE_AVAILABLE                   1
#define FM_GPIO_PZRE_AVAILABLE                    1
#define FM4_GPIO_PZRF_AVAILABLE                   1
#define FM_GPIO_PZRF_AVAILABLE                    1
#define FM4_GPIO_SPSR_AVAILABLE                   1
#define FM_GPIO_SPSR_AVAILABLE                    1
/*******************************************************************************
* HSSPI
*******************************************************************************/
#define FM4_HSSPI_CSAEXT_AVAILABLE                1
#define FM_HSSPI_CSAEXT_AVAILABLE                 1
#define FM4_HSSPI_CSCFG_AVAILABLE                 1
#define FM_HSSPI_CSCFG_AVAILABLE                  1
#define FM4_HSSPI_CSITIME_AVAILABLE               1
#define FM_HSSPI_CSITIME_AVAILABLE                1
#define FM4_HSSPI_DBCNT_AVAILABLE                 1
#define FM_HSSPI_DBCNT_AVAILABLE                  1
#define FM4_HSSPI_DMBCC_AVAILABLE                 1
#define FM_HSSPI_DMBCC_AVAILABLE                  1
#define FM4_HSSPI_DMBCS_AVAILABLE                 1
#define FM_HSSPI_DMBCS_AVAILABLE                  1
#define FM4_HSSPI_DMCFG_AVAILABLE                 1
#define FM_HSSPI_DMCFG_AVAILABLE                  1
#define FM4_HSSPI_DMDMAEN_AVAILABLE               1
#define FM_HSSPI_DMDMAEN_AVAILABLE                1
#define FM4_HSSPI_DMPSEL_AVAILABLE                1
#define FM_HSSPI_DMPSEL_AVAILABLE                 1
#define FM4_HSSPI_DMSTART_AVAILABLE               1
#define FM_HSSPI_DMSTART_AVAILABLE                1
#define FM4_HSSPI_DMSTATUS_AVAILABLE              1
#define FM_HSSPI_DMSTATUS_AVAILABLE               1
#define FM4_HSSPI_DMSTOP_AVAILABLE                1
#define FM_HSSPI_DMSTOP_AVAILABLE                 1
#define FM4_HSSPI_DMTRP_AVAILABLE                 1
#define FM_HSSPI_DMTRP_AVAILABLE                  1
#define FM4_HSSPI_FAULTC_AVAILABLE                1
#define FM_HSSPI_FAULTC_AVAILABLE                 1
#define FM4_HSSPI_FAULTF_AVAILABLE                1
#define FM_HSSPI_FAULTF_AVAILABLE                 1
#define FM4_HSSPI_FIFOCFG_AVAILABLE               1
#define FM_HSSPI_FIFOCFG_AVAILABLE                1
#define FM4_HSSPI_MCTRL_AVAILABLE                 1
#define FM_HSSPI_MCTRL_AVAILABLE                  1
#define FM4_HSSPI_MID_AVAILABLE                   1
#define FM_HSSPI_MID_AVAILABLE                    1
#define FM4_HSSPI_PCC0_AVAILABLE                  1
#define FM_HSSPI_PCC0_AVAILABLE                   1
#define FM4_HSSPI_PCC1_AVAILABLE                  1
#define FM_HSSPI_PCC1_AVAILABLE                   1
#define FM4_HSSPI_PCC2_AVAILABLE                  1
#define FM_HSSPI_PCC2_AVAILABLE                   1
#define FM4_HSSPI_PCC3_AVAILABLE                  1
#define FM_HSSPI_PCC3_AVAILABLE                   1
#define FM4_HSSPI_QDCLKR_AVAILABLE                1
#define FM_HSSPI_QDCLKR_AVAILABLE                 1
#define FM4_HSSPI_RDCSDC0_AVAILABLE               1
#define FM_HSSPI_RDCSDC0_AVAILABLE                1
#define FM4_HSSPI_RDCSDC1_AVAILABLE               1
#define FM_HSSPI_RDCSDC1_AVAILABLE                1
#define FM4_HSSPI_RDCSDC2_AVAILABLE               1
#define FM_HSSPI_RDCSDC2_AVAILABLE                1
#define FM4_HSSPI_RDCSDC3_AVAILABLE               1
#define FM_HSSPI_RDCSDC3_AVAILABLE                1
#define FM4_HSSPI_RDCSDC4_AVAILABLE               1
#define FM_HSSPI_RDCSDC4_AVAILABLE                1
#define FM4_HSSPI_RDCSDC5_AVAILABLE               1
#define FM_HSSPI_RDCSDC5_AVAILABLE                1
#define FM4_HSSPI_RDCSDC6_AVAILABLE               1
#define FM_HSSPI_RDCSDC6_AVAILABLE                1
#define FM4_HSSPI_RDCSDC7_AVAILABLE               1
#define FM_HSSPI_RDCSDC7_AVAILABLE                1
#define FM4_HSSPI_RXC_AVAILABLE                   1
#define FM_HSSPI_RXC_AVAILABLE                    1
#define FM4_HSSPI_RXE_AVAILABLE                   1
#define FM_HSSPI_RXE_AVAILABLE                    1
#define FM4_HSSPI_RXF_AVAILABLE                   1
#define FM_HSSPI_RXF_AVAILABLE                    1
#define FM4_HSSPI_RXFIFO0_AVAILABLE               1
#define FM_HSSPI_RXFIFO0_AVAILABLE                1
#define FM4_HSSPI_RXFIFO1_AVAILABLE               1
#define FM_HSSPI_RXFIFO1_AVAILABLE                1
#define FM4_HSSPI_RXFIFO10_AVAILABLE              1
#define FM_HSSPI_RXFIFO10_AVAILABLE               1
#define FM4_HSSPI_RXFIFO11_AVAILABLE              1
#define FM_HSSPI_RXFIFO11_AVAILABLE               1
#define FM4_HSSPI_RXFIFO12_AVAILABLE              1
#define FM_HSSPI_RXFIFO12_AVAILABLE               1
#define FM4_HSSPI_RXFIFO13_AVAILABLE              1
#define FM_HSSPI_RXFIFO13_AVAILABLE               1
#define FM4_HSSPI_RXFIFO14_AVAILABLE              1
#define FM_HSSPI_RXFIFO14_AVAILABLE               1
#define FM4_HSSPI_RXFIFO15_AVAILABLE              1
#define FM_HSSPI_RXFIFO15_AVAILABLE               1
#define FM4_HSSPI_RXFIFO2_AVAILABLE               1
#define FM_HSSPI_RXFIFO2_AVAILABLE                1
#define FM4_HSSPI_RXFIFO3_AVAILABLE               1
#define FM_HSSPI_RXFIFO3_AVAILABLE                1
#define FM4_HSSPI_RXFIFO4_AVAILABLE               1
#define FM_HSSPI_RXFIFO4_AVAILABLE                1
#define FM4_HSSPI_RXFIFO5_AVAILABLE               1
#define FM_HSSPI_RXFIFO5_AVAILABLE                1
#define FM4_HSSPI_RXFIFO6_AVAILABLE               1
#define FM_HSSPI_RXFIFO6_AVAILABLE                1
#define FM4_HSSPI_RXFIFO7_AVAILABLE               1
#define FM_HSSPI_RXFIFO7_AVAILABLE                1
#define FM4_HSSPI_RXFIFO8_AVAILABLE               1
#define FM_HSSPI_RXFIFO8_AVAILABLE                1
#define FM4_HSSPI_RXFIFO9_AVAILABLE               1
#define FM_HSSPI_RXFIFO9_AVAILABLE                1
#define FM4_HSSPI_TXC_AVAILABLE                   1
#define FM_HSSPI_TXC_AVAILABLE                    1
#define FM4_HSSPI_TXE_AVAILABLE                   1
#define FM_HSSPI_TXE_AVAILABLE                    1
#define FM4_HSSPI_TXF_AVAILABLE                   1
#define FM_HSSPI_TXF_AVAILABLE                    1
#define FM4_HSSPI_TXFIFO0_AVAILABLE               1
#define FM_HSSPI_TXFIFO0_AVAILABLE                1
#define FM4_HSSPI_TXFIFO1_AVAILABLE               1
#define FM_HSSPI_TXFIFO1_AVAILABLE                1
#define FM4_HSSPI_TXFIFO10_AVAILABLE              1
#define FM_HSSPI_TXFIFO10_AVAILABLE               1
#define FM4_HSSPI_TXFIFO11_AVAILABLE              1
#define FM_HSSPI_TXFIFO11_AVAILABLE               1
#define FM4_HSSPI_TXFIFO12_AVAILABLE              1
#define FM_HSSPI_TXFIFO12_AVAILABLE               1
#define FM4_HSSPI_TXFIFO13_AVAILABLE              1
#define FM_HSSPI_TXFIFO13_AVAILABLE               1
#define FM4_HSSPI_TXFIFO14_AVAILABLE              1
#define FM_HSSPI_TXFIFO14_AVAILABLE               1
#define FM4_HSSPI_TXFIFO15_AVAILABLE              1
#define FM_HSSPI_TXFIFO15_AVAILABLE               1
#define FM4_HSSPI_TXFIFO2_AVAILABLE               1
#define FM_HSSPI_TXFIFO2_AVAILABLE                1
#define FM4_HSSPI_TXFIFO3_AVAILABLE               1
#define FM_HSSPI_TXFIFO3_AVAILABLE                1
#define FM4_HSSPI_TXFIFO4_AVAILABLE               1
#define FM_HSSPI_TXFIFO4_AVAILABLE                1
#define FM4_HSSPI_TXFIFO5_AVAILABLE               1
#define FM_HSSPI_TXFIFO5_AVAILABLE                1
#define FM4_HSSPI_TXFIFO6_AVAILABLE               1
#define FM_HSSPI_TXFIFO6_AVAILABLE                1
#define FM4_HSSPI_TXFIFO7_AVAILABLE               1
#define FM_HSSPI_TXFIFO7_AVAILABLE                1
#define FM4_HSSPI_TXFIFO8_AVAILABLE               1
#define FM_HSSPI_TXFIFO8_AVAILABLE                1
#define FM4_HSSPI_TXFIFO9_AVAILABLE               1
#define FM_HSSPI_TXFIFO9_AVAILABLE                1
#define FM4_HSSPI_WRCSDC0_AVAILABLE               1
#define FM_HSSPI_WRCSDC0_AVAILABLE                1
#define FM4_HSSPI_WRCSDC1_AVAILABLE               1
#define FM_HSSPI_WRCSDC1_AVAILABLE                1
#define FM4_HSSPI_WRCSDC2_AVAILABLE               1
#define FM_HSSPI_WRCSDC2_AVAILABLE                1
#define FM4_HSSPI_WRCSDC3_AVAILABLE               1
#define FM_HSSPI_WRCSDC3_AVAILABLE                1
#define FM4_HSSPI_WRCSDC4_AVAILABLE               1
#define FM_HSSPI_WRCSDC4_AVAILABLE                1
#define FM4_HSSPI_WRCSDC5_AVAILABLE               1
#define FM_HSSPI_WRCSDC5_AVAILABLE                1
#define FM4_HSSPI_WRCSDC6_AVAILABLE               1
#define FM_HSSPI_WRCSDC6_AVAILABLE                1
#define FM4_HSSPI_WRCSDC7_AVAILABLE               1
#define FM_HSSPI_WRCSDC7_AVAILABLE                1
/*******************************************************************************
* HWWDT
*******************************************************************************/
#define FM4_HWWDT_WDG_CTL_AVAILABLE               1
#define FM_HWWDT_WDG_CTL_AVAILABLE                1
#define FM4_HWWDT_WDG_ICL_AVAILABLE               1
#define FM_HWWDT_WDG_ICL_AVAILABLE                1
#define FM4_HWWDT_WDG_LCK_AVAILABLE               1
#define FM_HWWDT_WDG_LCK_AVAILABLE                1
#define FM4_HWWDT_WDG_LDR_AVAILABLE               1
#define FM_HWWDT_WDG_LDR_AVAILABLE                1
#define FM4_HWWDT_WDG_RIS_AVAILABLE               1
#define FM_HWWDT_WDG_RIS_AVAILABLE                1
#define FM4_HWWDT_WDG_VLR_AVAILABLE               1
#define FM_HWWDT_WDG_VLR_AVAILABLE                1
/*******************************************************************************
* I2S0
*******************************************************************************/
#define FM4_I2S_CNTREG_AVAILABLE                  1
#define FM_I2S_CNTREG_AVAILABLE                   1
#define FM4_I2S_DMAACT_AVAILABLE                  1
#define FM_I2S_DMAACT_AVAILABLE                   1
#define FM4_I2S_INTCNT_AVAILABLE                  1
#define FM_I2S_INTCNT_AVAILABLE                   1
#define FM4_I2S_MCR0REG_AVAILABLE                 1
#define FM_I2S_MCR0REG_AVAILABLE                  1
#define FM4_I2S_MCR1REG_AVAILABLE                 1
#define FM_I2S_MCR1REG_AVAILABLE                  1
#define FM4_I2S_MCR2REG_AVAILABLE                 1
#define FM_I2S_MCR2REG_AVAILABLE                  1
#define FM4_I2S_OPRREG_AVAILABLE                  1
#define FM_I2S_OPRREG_AVAILABLE                   1
#define FM4_I2S_RXFDAT_AVAILABLE                  1
#define FM_I2S_RXFDAT_AVAILABLE                   1
#define FM4_I2S_SRST_AVAILABLE                    1
#define FM_I2S_SRST_AVAILABLE                     1
#define FM4_I2S_STATUS_AVAILABLE                  1
#define FM_I2S_STATUS_AVAILABLE                   1
#define FM4_I2S_TSTREG_AVAILABLE                  1
#define FM_I2S_TSTREG_AVAILABLE                   1
#define FM4_I2S_TXFDAT_AVAILABLE                  1
#define FM_I2S_TXFDAT_AVAILABLE                   1
/*******************************************************************************
* I2SPRE
*******************************************************************************/
#define FM4_I2SPRE_ICCR_AVAILABLE                 1
#define FM_I2SPRE_ICCR_AVAILABLE                  1
#define FM4_I2SPRE_IP_STR_AVAILABLE               1
#define FM_I2SPRE_IP_STR_AVAILABLE                1
#define FM4_I2SPRE_IPCR1_AVAILABLE                1
#define FM_I2SPRE_IPCR1_AVAILABLE                 1
#define FM4_I2SPRE_IPCR2_AVAILABLE                1
#define FM_I2SPRE_IPCR2_AVAILABLE                 1
#define FM4_I2SPRE_IPCR3_AVAILABLE                1
#define FM_I2SPRE_IPCR3_AVAILABLE                 1
#define FM4_I2SPRE_IPCR4_AVAILABLE                1
#define FM_I2SPRE_IPCR4_AVAILABLE                 1
#define FM4_I2SPRE_IPCR5_AVAILABLE                1
#define FM_I2SPRE_IPCR5_AVAILABLE                 1
#define FM4_I2SPRE_IPINT_CLR_AVAILABLE            1
#define FM_I2SPRE_IPINT_CLR_AVAILABLE             1
#define FM4_I2SPRE_IPINT_ENR_AVAILABLE            1
#define FM_I2SPRE_IPINT_ENR_AVAILABLE             1
#define FM4_I2SPRE_IPINT_STR_AVAILABLE            1
#define FM_I2SPRE_IPINT_STR_AVAILABLE             1
/*******************************************************************************
* INTREQ
*******************************************************************************/
#define FM4_INTREQ_DRQSEL_AVAILABLE               1
#define FM_INTREQ_DRQSEL_AVAILABLE                1
#define FM4_INTREQ_EXC02MON_AVAILABLE             1
#define FM_INTREQ_EXC02MON_AVAILABLE              1
#define FM4_INTREQ_IRQ000MON_AVAILABLE            1
#define FM_INTREQ_IRQ000MON_AVAILABLE             1
#define FM4_INTREQ_IRQ001MON_AVAILABLE            1
#define FM_INTREQ_IRQ001MON_AVAILABLE             1
#define FM4_INTREQ_IRQ002MON_AVAILABLE            1
#define FM_INTREQ_IRQ002MON_AVAILABLE             1
#define FM4_INTREQ_IRQ003MON_AVAILABLE            1
#define FM_INTREQ_IRQ003MON_AVAILABLE             1
#define FM4_INTREQ_IRQ003SEL_AVAILABLE            1
#define FM_INTREQ_IRQ003SEL_AVAILABLE             1
#define FM4_INTREQ_IRQ004MON_AVAILABLE            1
#define FM_INTREQ_IRQ004MON_AVAILABLE             1
#define FM4_INTREQ_IRQ004SEL_AVAILABLE            1
#define FM_INTREQ_IRQ004SEL_AVAILABLE             1
#define FM4_INTREQ_IRQ005MON_AVAILABLE            1
#define FM_INTREQ_IRQ005MON_AVAILABLE             1
#define FM4_INTREQ_IRQ005SEL_AVAILABLE            1
#define FM_INTREQ_IRQ005SEL_AVAILABLE             1
#define FM4_INTREQ_IRQ006MON_AVAILABLE            1
#define FM_INTREQ_IRQ006MON_AVAILABLE             1
#define FM4_INTREQ_IRQ006SEL_AVAILABLE            1
#define FM_INTREQ_IRQ006SEL_AVAILABLE             1
#define FM4_INTREQ_IRQ007MON_AVAILABLE            1
#define FM_INTREQ_IRQ007MON_AVAILABLE             1
#define FM4_INTREQ_IRQ007SEL_AVAILABLE            1
#define FM_INTREQ_IRQ007SEL_AVAILABLE             1
#define FM4_INTREQ_IRQ008MON_AVAILABLE            1
#define FM_INTREQ_IRQ008MON_AVAILABLE             1
#define FM4_INTREQ_IRQ008SEL_AVAILABLE            1
#define FM_INTREQ_IRQ008SEL_AVAILABLE             1
#define FM4_INTREQ_IRQ009MON_AVAILABLE            1
#define FM_INTREQ_IRQ009MON_AVAILABLE             1
#define FM4_INTREQ_IRQ009SEL_AVAILABLE            1
#define FM_INTREQ_IRQ009SEL_AVAILABLE             1
#define FM4_INTREQ_IRQ010MON_AVAILABLE            1
#define FM_INTREQ_IRQ010MON_AVAILABLE             1
#define FM4_INTREQ_IRQ010SEL_AVAILABLE            1
#define FM_INTREQ_IRQ010SEL_AVAILABLE             1
#define FM4_INTREQ_IRQ011MON_AVAILABLE            1
#define FM_INTREQ_IRQ011MON_AVAILABLE             1
#define FM4_INTREQ_IRQ012MON_AVAILABLE            1
#define FM_INTREQ_IRQ012MON_AVAILABLE             1
#define FM4_INTREQ_IRQ013MON_AVAILABLE            1
#define FM_INTREQ_IRQ013MON_AVAILABLE             1
#define FM4_INTREQ_IRQ014MON_AVAILABLE            1
#define FM_INTREQ_IRQ014MON_AVAILABLE             1
#define FM4_INTREQ_IRQ015MON_AVAILABLE            1
#define FM_INTREQ_IRQ015MON_AVAILABLE             1
#define FM4_INTREQ_IRQ016MON_AVAILABLE            1
#define FM_INTREQ_IRQ016MON_AVAILABLE             1
#define FM4_INTREQ_IRQ017MON_AVAILABLE            1
#define FM_INTREQ_IRQ017MON_AVAILABLE             1
#define FM4_INTREQ_IRQ018MON_AVAILABLE            1
#define FM_INTREQ_IRQ018MON_AVAILABLE             1
#define FM4_INTREQ_IRQ019MON_AVAILABLE            1
#define FM_INTREQ_IRQ019MON_AVAILABLE             1
#define FM4_INTREQ_IRQ020MON_AVAILABLE            1
#define FM_INTREQ_IRQ020MON_AVAILABLE             1
#define FM4_INTREQ_IRQ021MON_AVAILABLE            1
#define FM_INTREQ_IRQ021MON_AVAILABLE             1
#define FM4_INTREQ_IRQ022MON_AVAILABLE            1
#define FM_INTREQ_IRQ022MON_AVAILABLE             1
#define FM4_INTREQ_IRQ023MON_AVAILABLE            1
#define FM_INTREQ_IRQ023MON_AVAILABLE             1
#define FM4_INTREQ_IRQ024MON_AVAILABLE            1
#define FM_INTREQ_IRQ024MON_AVAILABLE             1
#define FM4_INTREQ_IRQ025MON_AVAILABLE            1
#define FM_INTREQ_IRQ025MON_AVAILABLE             1
#define FM4_INTREQ_IRQ026MON_AVAILABLE            1
#define FM_INTREQ_IRQ026MON_AVAILABLE             1
#define FM4_INTREQ_IRQ027MON_AVAILABLE            1
#define FM_INTREQ_IRQ027MON_AVAILABLE             1
#define FM4_INTREQ_IRQ028MON_AVAILABLE            1
#define FM_INTREQ_IRQ028MON_AVAILABLE             1
#define FM4_INTREQ_IRQ029MON_AVAILABLE            1
#define FM_INTREQ_IRQ029MON_AVAILABLE             1
#define FM4_INTREQ_IRQ030MON_AVAILABLE            1
#define FM_INTREQ_IRQ030MON_AVAILABLE             1
#define FM4_INTREQ_IRQ031MON_AVAILABLE            1
#define FM_INTREQ_IRQ031MON_AVAILABLE             1
#define FM4_INTREQ_IRQ032MON_AVAILABLE            1
#define FM_INTREQ_IRQ032MON_AVAILABLE             1
#define FM4_INTREQ_IRQ033MON_AVAILABLE            1
#define FM_INTREQ_IRQ033MON_AVAILABLE             1
#define FM4_INTREQ_IRQ034MON_AVAILABLE            1
#define FM_INTREQ_IRQ034MON_AVAILABLE             1
#define FM4_INTREQ_IRQ035MON_AVAILABLE            1
#define FM_INTREQ_IRQ035MON_AVAILABLE             1
#define FM4_INTREQ_IRQ036MON_AVAILABLE            1
#define FM_INTREQ_IRQ036MON_AVAILABLE             1
#define FM4_INTREQ_IRQ037MON_AVAILABLE            1
#define FM_INTREQ_IRQ037MON_AVAILABLE             1
#define FM4_INTREQ_IRQ038MON_AVAILABLE            1
#define FM_INTREQ_IRQ038MON_AVAILABLE             1
#define FM4_INTREQ_IRQ039MON_AVAILABLE            1
#define FM_INTREQ_IRQ039MON_AVAILABLE             1
#define FM4_INTREQ_IRQ040MON_AVAILABLE            1
#define FM_INTREQ_IRQ040MON_AVAILABLE             1
#define FM4_INTREQ_IRQ041MON_AVAILABLE            1
#define FM_INTREQ_IRQ041MON_AVAILABLE             1
#define FM4_INTREQ_IRQ042MON_AVAILABLE            1
#define FM_INTREQ_IRQ042MON_AVAILABLE             1
#define FM4_INTREQ_IRQ043MON_AVAILABLE            1
#define FM_INTREQ_IRQ043MON_AVAILABLE             1
#define FM4_INTREQ_IRQ044MON_AVAILABLE            1
#define FM_INTREQ_IRQ044MON_AVAILABLE             1
#define FM4_INTREQ_IRQ045MON_AVAILABLE            1
#define FM_INTREQ_IRQ045MON_AVAILABLE             1
#define FM4_INTREQ_IRQ046MON_AVAILABLE            1
#define FM_INTREQ_IRQ046MON_AVAILABLE             1
#define FM4_INTREQ_IRQ047MON_AVAILABLE            1
#define FM_INTREQ_IRQ047MON_AVAILABLE             1
#define FM4_INTREQ_IRQ048MON_AVAILABLE            1
#define FM_INTREQ_IRQ048MON_AVAILABLE             1
#define FM4_INTREQ_IRQ049MON_AVAILABLE            1
#define FM_INTREQ_IRQ049MON_AVAILABLE             1
#define FM4_INTREQ_IRQ050MON_AVAILABLE            1
#define FM_INTREQ_IRQ050MON_AVAILABLE             1
#define FM4_INTREQ_IRQ051MON_AVAILABLE            1
#define FM_INTREQ_IRQ051MON_AVAILABLE             1
#define FM4_INTREQ_IRQ052MON_AVAILABLE            1
#define FM_INTREQ_IRQ052MON_AVAILABLE             1
#define FM4_INTREQ_IRQ053MON_AVAILABLE            1
#define FM_INTREQ_IRQ053MON_AVAILABLE             1
#define FM4_INTREQ_IRQ054MON_AVAILABLE            1
#define FM_INTREQ_IRQ054MON_AVAILABLE             1
#define FM4_INTREQ_IRQ055MON_AVAILABLE            1
#define FM_INTREQ_IRQ055MON_AVAILABLE             1
#define FM4_INTREQ_IRQ056MON_AVAILABLE            1
#define FM_INTREQ_IRQ056MON_AVAILABLE             1
#define FM4_INTREQ_IRQ057MON_AVAILABLE            1
#define FM_INTREQ_IRQ057MON_AVAILABLE             1
#define FM4_INTREQ_IRQ058MON_AVAILABLE            1
#define FM_INTREQ_IRQ058MON_AVAILABLE             1
#define FM4_INTREQ_IRQ059MON_AVAILABLE            1
#define FM_INTREQ_IRQ059MON_AVAILABLE             1
#define FM4_INTREQ_IRQ060MON_AVAILABLE            1
#define FM_INTREQ_IRQ060MON_AVAILABLE             1
#define FM4_INTREQ_IRQ061MON_AVAILABLE            1
#define FM_INTREQ_IRQ061MON_AVAILABLE             1
#define FM4_INTREQ_IRQ062MON_AVAILABLE            1
#define FM_INTREQ_IRQ062MON_AVAILABLE             1
#define FM4_INTREQ_IRQ063MON_AVAILABLE            1
#define FM_INTREQ_IRQ063MON_AVAILABLE             1
#define FM4_INTREQ_IRQ064MON_AVAILABLE            1
#define FM_INTREQ_IRQ064MON_AVAILABLE             1
#define FM4_INTREQ_IRQ065MON_AVAILABLE            1
#define FM_INTREQ_IRQ065MON_AVAILABLE             1
#define FM4_INTREQ_IRQ066MON_AVAILABLE            1
#define FM_INTREQ_IRQ066MON_AVAILABLE             1
#define FM4_INTREQ_IRQ067MON_AVAILABLE            1
#define FM_INTREQ_IRQ067MON_AVAILABLE             1
#define FM4_INTREQ_IRQ068MON_AVAILABLE            1
#define FM_INTREQ_IRQ068MON_AVAILABLE             1
#define FM4_INTREQ_IRQ069MON_AVAILABLE            1
#define FM_INTREQ_IRQ069MON_AVAILABLE             1
#define FM4_INTREQ_IRQ070MON_AVAILABLE            1
#define FM_INTREQ_IRQ070MON_AVAILABLE             1
#define FM4_INTREQ_IRQ071MON_AVAILABLE            1
