mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xj/common/s6e2c1xj.h
#define FM4_RTC_BREG66_AVAILABLE                  1
#define FM_RTC_BREG66_AVAILABLE                   1
#define FM4_RTC_BREG67_AVAILABLE                  1
#define FM_RTC_BREG67_AVAILABLE                   1
#define FM4_RTC_BREG68_AVAILABLE                  1
#define FM_RTC_BREG68_AVAILABLE                   1
#define FM4_RTC_BREG69_AVAILABLE                  1
#define FM_RTC_BREG69_AVAILABLE                   1
#define FM4_RTC_BREG6A_AVAILABLE                  1
#define FM_RTC_BREG6A_AVAILABLE                   1
#define FM4_RTC_BREG6B_AVAILABLE                  1
#define FM_RTC_BREG6B_AVAILABLE                   1
#define FM4_RTC_BREG6C_AVAILABLE                  1
#define FM_RTC_BREG6C_AVAILABLE                   1
#define FM4_RTC_BREG6D_AVAILABLE                  1
#define FM_RTC_BREG6D_AVAILABLE                   1
#define FM4_RTC_BREG6E_AVAILABLE                  1
#define FM_RTC_BREG6E_AVAILABLE                   1
#define FM4_RTC_BREG6F_AVAILABLE                  1
#define FM_RTC_BREG6F_AVAILABLE                   1
#define FM4_RTC_BREG70_AVAILABLE                  1
#define FM_RTC_BREG70_AVAILABLE                   1
#define FM4_RTC_BREG71_AVAILABLE                  1
#define FM_RTC_BREG71_AVAILABLE                   1
#define FM4_RTC_BREG72_AVAILABLE                  1
#define FM_RTC_BREG72_AVAILABLE                   1
#define FM4_RTC_BREG73_AVAILABLE                  1
#define FM_RTC_BREG73_AVAILABLE                   1
#define FM4_RTC_BREG74_AVAILABLE                  1
#define FM_RTC_BREG74_AVAILABLE                   1
#define FM4_RTC_BREG75_AVAILABLE                  1
#define FM_RTC_BREG75_AVAILABLE                   1
#define FM4_RTC_BREG76_AVAILABLE                  1
#define FM_RTC_BREG76_AVAILABLE                   1
#define FM4_RTC_BREG77_AVAILABLE                  1
#define FM_RTC_BREG77_AVAILABLE                   1
#define FM4_RTC_BREG78_AVAILABLE                  1
#define FM_RTC_BREG78_AVAILABLE                   1
#define FM4_RTC_BREG79_AVAILABLE                  1
#define FM_RTC_BREG79_AVAILABLE                   1
#define FM4_RTC_BREG7A_AVAILABLE                  1
#define FM_RTC_BREG7A_AVAILABLE                   1
#define FM4_RTC_BREG7B_AVAILABLE                  1
#define FM_RTC_BREG7B_AVAILABLE                   1
#define FM4_RTC_BREG7C_AVAILABLE                  1
#define FM_RTC_BREG7C_AVAILABLE                   1
#define FM4_RTC_BREG7D_AVAILABLE                  1
#define FM_RTC_BREG7D_AVAILABLE                   1
#define FM4_RTC_BREG7E_AVAILABLE                  1
#define FM_RTC_BREG7E_AVAILABLE                   1
#define FM4_RTC_BREG7F_AVAILABLE                  1
#define FM_RTC_BREG7F_AVAILABLE                   1
#define FM4_RTC_CCB_AVAILABLE                     1
#define FM_RTC_CCB_AVAILABLE                      1
#define FM4_RTC_CCS_AVAILABLE                     1
#define FM_RTC_CCS_AVAILABLE                      1
#define FM4_RTC_EWKUP_AVAILABLE                   1
#define FM_RTC_EWKUP_AVAILABLE                    1
#define FM4_RTC_HIBRST_AVAILABLE                  1
#define FM_RTC_HIBRST_AVAILABLE                   1
#define FM4_RTC_VB_CLKDIV_AVAILABLE               1
#define FM_RTC_VB_CLKDIV_AVAILABLE                1
#define FM4_RTC_VBDDR_AVAILABLE                   1
#define FM_RTC_VBDDR_AVAILABLE                    1
#define FM4_RTC_VBDIR_AVAILABLE                   1
#define FM_RTC_VBDIR_AVAILABLE                    1
#define FM4_RTC_VBDOR_AVAILABLE                   1
#define FM_RTC_VBDOR_AVAILABLE                    1
#define FM4_RTC_VBPCR_AVAILABLE                   1
#define FM_RTC_VBPCR_AVAILABLE                    1
#define FM4_RTC_VBPFR_AVAILABLE                   1
#define FM_RTC_VBPFR_AVAILABLE                    1
#define FM4_RTC_VBPZR_AVAILABLE                   1
#define FM_RTC_VBPZR_AVAILABLE                    1
#define FM4_RTC_VDET_AVAILABLE                    1
#define FM_RTC_VDET_AVAILABLE                     1
#define FM4_RTC_WTCAL0_AVAILABLE                  1
#define FM_RTC_WTCAL0_AVAILABLE                   1
#define FM4_RTC_WTCAL1_AVAILABLE                  1
#define FM_RTC_WTCAL1_AVAILABLE                   1
#define FM4_RTC_WTCALEN_AVAILABLE                 1
#define FM_RTC_WTCALEN_AVAILABLE                  1
#define FM4_RTC_WTCALPRD_AVAILABLE                1
#define FM_RTC_WTCALPRD_AVAILABLE                 1
#define FM4_RTC_WTCOSEL_AVAILABLE                 1
#define FM_RTC_WTCOSEL_AVAILABLE                  1
#define FM4_RTC_WTCR10_AVAILABLE                  1
#define FM_RTC_WTCR10_AVAILABLE                   1
#define FM4_RTC_WTCR11_AVAILABLE                  1
#define FM_RTC_WTCR11_AVAILABLE                   1
#define FM4_RTC_WTCR12_AVAILABLE                  1
#define FM_RTC_WTCR12_AVAILABLE                   1
#define FM4_RTC_WTCR13_AVAILABLE                  1
#define FM_RTC_WTCR13_AVAILABLE                   1
#define FM4_RTC_WTCR20_AVAILABLE                  1
#define FM_RTC_WTCR20_AVAILABLE                   1
#define FM4_RTC_WTCR21_AVAILABLE                  1
#define FM_RTC_WTCR21_AVAILABLE                   1
#define FM4_RTC_WTDIV_AVAILABLE                   1
#define FM_RTC_WTDIV_AVAILABLE                    1
#define FM4_RTC_WTDIVEN_AVAILABLE                 1
#define FM_RTC_WTDIVEN_AVAILABLE                  1
#define FM4_RTC_WTDR_AVAILABLE                    1
#define FM_RTC_WTDR_AVAILABLE                     1
#define FM4_RTC_WTDW_AVAILABLE                    1
#define FM_RTC_WTDW_AVAILABLE                     1
#define FM4_RTC_WTHR_AVAILABLE                    1
#define FM_RTC_WTHR_AVAILABLE                     1
#define FM4_RTC_WTMIR_AVAILABLE                   1
#define FM_RTC_WTMIR_AVAILABLE                    1
#define FM4_RTC_WTMOR_AVAILABLE                   1
#define FM_RTC_WTMOR_AVAILABLE                    1
#define FM4_RTC_WTOSCCNT_AVAILABLE                1
#define FM_RTC_WTOSCCNT_AVAILABLE                 1
#define FM4_RTC_WTSR_AVAILABLE                    1
#define FM_RTC_WTSR_AVAILABLE                     1
#define FM4_RTC_WTTR0_AVAILABLE                   1
#define FM_RTC_WTTR0_AVAILABLE                    1
#define FM4_RTC_WTTR1_AVAILABLE                   1
#define FM_RTC_WTTR1_AVAILABLE                    1
#define FM4_RTC_WTTR2_AVAILABLE                   1
#define FM_RTC_WTTR2_AVAILABLE                    1
#define FM4_RTC_WTYR_AVAILABLE                    1
#define FM_RTC_WTYR_AVAILABLE                     1
/*******************************************************************************
* SBSSR
*******************************************************************************/
#define FM4_SBSSR_BTSSSR_AVAILABLE                1
#define FM_SBSSR_BTSSSR_AVAILABLE                 1
/*******************************************************************************
* SDIF
*******************************************************************************/
#define FM4_SDIF_ADMAEST_AVAILABLE                1
#define FM_SDIF_ADMAEST_AVAILABLE                 1
#define FM4_SDIF_AHBCFGH_AVAILABLE                1
#define FM_SDIF_AHBCFGH_AVAILABLE                 1
#define FM4_SDIF_AHBCFGL_AVAILABLE                1
#define FM_SDIF_AHBCFGL_AVAILABLE                 1
#define FM4_SDIF_CAPBLTY0_AVAILABLE               1
#define FM_SDIF_CAPBLTY0_AVAILABLE                1
#define FM4_SDIF_CAPBLTY1_AVAILABLE               1
#define FM_SDIF_CAPBLTY1_AVAILABLE                1
#define FM4_SDIF_CAPBLTY2_AVAILABLE               1
#define FM_SDIF_CAPBLTY2_AVAILABLE                1
#define FM4_SDIF_CAPBLTY3_AVAILABLE               1
#define FM_SDIF_CAPBLTY3_AVAILABLE                1
#define FM4_SDIF_FEACEST_AVAILABLE                1
#define FM_SDIF_FEACEST_AVAILABLE                 1
#define FM4_SDIF_MCRPCKBH_AVAILABLE               1
#define FM_SDIF_MCRPCKBH_AVAILABLE                1
#define FM4_SDIF_MCRPCKBL_AVAILABLE               1
#define FM_SDIF_MCRPCKBL_AVAILABLE                1
#define FM4_SDIF_MCWIRQC0_AVAILABLE               1
#define FM_SDIF_MCWIRQC0_AVAILABLE                1
#define FM4_SDIF_MCWIRQC1_AVAILABLE               1
#define FM_SDIF_MCWIRQC1_AVAILABLE                1
#define FM4_SDIF_MCWIRQC2_AVAILABLE               1
#define FM_SDIF_MCWIRQC2_AVAILABLE                1
#define FM4_SDIF_MCWIRQC3_AVAILABLE               1
#define FM_SDIF_MCWIRQC3_AVAILABLE                1
#define FM4_SDIF_MMCSDCH_AVAILABLE                1
#define FM_SDIF_MMCSDCH_AVAILABLE                 1
#define FM4_SDIF_MMCSDCL_AVAILABLE                1
#define FM_SDIF_MMCSDCL_AVAILABLE                 1
#define FM4_SDIF_MXCCAPY0_AVAILABLE               1
#define FM_SDIF_MXCCAPY0_AVAILABLE                1
#define FM4_SDIF_MXCCAPY1_AVAILABLE               1
#define FM_SDIF_MXCCAPY1_AVAILABLE                1
#define FM4_SDIF_MXCCAPY2_AVAILABLE               1
#define FM_SDIF_MXCCAPY2_AVAILABLE                1
#define FM4_SDIF_MXCCAPY3_AVAILABLE               1
#define FM_SDIF_MXCCAPY3_AVAILABLE                1
#define FM4_SDIF_PSWISGEH_AVAILABLE               1
#define FM_SDIF_PSWISGEH_AVAILABLE                1
#define FM4_SDIF_PSWISGEL_AVAILABLE               1
#define FM_SDIF_PSWISGEL_AVAILABLE                1
#define FM4_SDIF_PSWISTEH_AVAILABLE               1
#define FM_SDIF_PSWISTEH_AVAILABLE                1
#define FM4_SDIF_PSWISTEL_AVAILABLE               1
#define FM_SDIF_PSWISTEL_AVAILABLE                1
#define FM4_SDIF_PSWISTH_AVAILABLE                1
#define FM_SDIF_PSWISTH_AVAILABLE                 1
#define FM4_SDIF_PSWISTL_AVAILABLE                1
#define FM_SDIF_PSWISTL_AVAILABLE                 1
#define FM4_SDIF_SACMDEST_AVAILABLE               1
#define FM_SDIF_SACMDEST_AVAILABLE                1
#define FM4_SDIF_SADSA0_AVAILABLE                 1
#define FM_SDIF_SADSA0_AVAILABLE                  1
#define FM4_SDIF_SADSA1_AVAILABLE                 1
#define FM_SDIF_SADSA1_AVAILABLE                  1
#define FM4_SDIF_SADSA2_AVAILABLE                 1
#define FM_SDIF_SADSA2_AVAILABLE                  1
#define FM4_SDIF_SADSA3_AVAILABLE                 1
#define FM_SDIF_SADSA3_AVAILABLE                  1
#define FM4_SDIF_SBLCNT_AVAILABLE                 1
#define FM_SDIF_SBLCNT_AVAILABLE                  1
#define FM4_SDIF_SBLKGPCTL_AVAILABLE              1
#define FM_SDIF_SBLKGPCTL_AVAILABLE               1
#define FM4_SDIF_SBSIZE_AVAILABLE                 1
#define FM_SDIF_SBSIZE_AVAILABLE                  1
#define FM4_SDIF_SBUFDP_AVAILABLE                 1
#define FM_SDIF_SBUFDP_AVAILABLE                  1
#define FM4_SDIF_SCDETECS_AVAILABLE               1
#define FM_SDIF_SCDETECS_AVAILABLE                1
#define FM4_SDIF_SCLKCTL_AVAILABLE                1
#define FM_SDIF_SCLKCTL_AVAILABLE                 1
#define FM4_SDIF_SCMMD_AVAILABLE                  1
#define FM_SDIF_SCMMD_AVAILABLE                   1
#define FM4_SDIF_SEINTSGE_AVAILABLE               1
#define FM_SDIF_SEINTSGE_AVAILABLE                1
#define FM4_SDIF_SEINTST_AVAILABLE                1
#define FM_SDIF_SEINTST_AVAILABLE                 1
#define FM4_SDIF_SEINTSTE_AVAILABLE               1
#define FM_SDIF_SEINTSTE_AVAILABLE                1
#define FM4_SDIF_SFEEIST_AVAILABLE                1
#define FM_SDIF_SFEEIST_AVAILABLE                 1
#define FM4_SDIF_SHCTL1_AVAILABLE                 1
#define FM_SDIF_SHCTL1_AVAILABLE                  1
#define FM4_SDIF_SHCTL2_AVAILABLE                 1
#define FM_SDIF_SHCTL2_AVAILABLE                  1
#define FM4_SDIF_SHCTLV_AVAILABLE                 1
#define FM_SDIF_SHCTLV_AVAILABLE                  1
#define FM4_SDIF_SNINTSGE_AVAILABLE               1
#define FM_SDIF_SNINTSGE_AVAILABLE                1
#define FM4_SDIF_SNINTST_AVAILABLE                1
#define FM_SDIF_SNINTST_AVAILABLE                 1
#define FM4_SDIF_SNINTSTE_AVAILABLE               1
#define FM_SDIF_SNINTSTE_AVAILABLE                1
#define FM4_SDIF_SPRSTAT_AVAILABLE                1
#define FM_SDIF_SPRSTAT_AVAILABLE                 1
#define FM4_SDIF_SPRVAL0_AVAILABLE                1
#define FM_SDIF_SPRVAL0_AVAILABLE                 1
#define FM4_SDIF_SPRVAL1_AVAILABLE                1
#define FM_SDIF_SPRVAL1_AVAILABLE                 1
#define FM4_SDIF_SPRVAL2_AVAILABLE                1
#define FM_SDIF_SPRVAL2_AVAILABLE                 1
#define FM4_SDIF_SPRVAL3_AVAILABLE                1
#define FM_SDIF_SPRVAL3_AVAILABLE                 1
#define FM4_SDIF_SPRVAL4_AVAILABLE                1
#define FM_SDIF_SPRVAL4_AVAILABLE                 1
#define FM4_SDIF_SPRVAL5_AVAILABLE                1
#define FM_SDIF_SPRVAL5_AVAILABLE                 1
#define FM4_SDIF_SPRVAL6_AVAILABLE                1
#define FM_SDIF_SPRVAL6_AVAILABLE                 1
#define FM4_SDIF_SPRVAL7_AVAILABLE                1
#define FM_SDIF_SPRVAL7_AVAILABLE                 1
#define FM4_SDIF_SPWRCTL_AVAILABLE                1
#define FM_SDIF_SPWRCTL_AVAILABLE                 1
#define FM4_SDIF_SPWSWCH_AVAILABLE                1
#define FM_SDIF_SPWSWCH_AVAILABLE                 1
#define FM4_SDIF_SPWSWCL_AVAILABLE                1
#define FM_SDIF_SPWSWCL_AVAILABLE                 1
#define FM4_SDIF_SRESP0_AVAILABLE                 1
#define FM_SDIF_SRESP0_AVAILABLE                  1
#define FM4_SDIF_SRESP1_AVAILABLE                 1
#define FM_SDIF_SRESP1_AVAILABLE                  1
#define FM4_SDIF_SRESP2_AVAILABLE                 1
#define FM_SDIF_SRESP2_AVAILABLE                  1
#define FM4_SDIF_SRESP3_AVAILABLE                 1
#define FM_SDIF_SRESP3_AVAILABLE                  1
#define FM4_SDIF_SRESP4_AVAILABLE                 1
#define FM_SDIF_SRESP4_AVAILABLE                  1
#define FM4_SDIF_SRESP5_AVAILABLE                 1
#define FM_SDIF_SRESP5_AVAILABLE                  1
#define FM4_SDIF_SRESP6_AVAILABLE                 1
#define FM_SDIF_SRESP6_AVAILABLE                  1
#define FM4_SDIF_SRESP7_AVAILABLE                 1
#define FM_SDIF_SRESP7_AVAILABLE                  1
#define FM4_SDIF_SSA1_AVAILABLE                   1
#define FM_SDIF_SSA1_AVAILABLE                    1
#define FM4_SDIF_SSA2_AVAILABLE                   1
#define FM_SDIF_SSA2_AVAILABLE                    1
#define FM4_SDIF_SSHBCTLH_AVAILABLE               1
#define FM_SDIF_SSHBCTLH_AVAILABLE                1
#define FM4_SDIF_SSHBCTLL_AVAILABLE               1
#define FM_SDIF_SSHBCTLL_AVAILABLE                1
#define FM4_SDIF_SSLIST_AVAILABLE                 1
#define FM_SDIF_SSLIST_AVAILABLE                  1
#define FM4_SDIF_SSRST_AVAILABLE                  1
#define FM_SDIF_SSRST_AVAILABLE                   1
#define FM4_SDIF_STOCTL_AVAILABLE                 1
#define FM_SDIF_STOCTL_AVAILABLE                  1
#define FM4_SDIF_STRSFMD_AVAILABLE                1
#define FM_SDIF_STRSFMD_AVAILABLE                 1
#define FM4_SDIF_STUNSETH_AVAILABLE               1
#define FM_SDIF_STUNSETH_AVAILABLE                1
#define FM4_SDIF_STUNSETL_AVAILABLE               1
#define FM_SDIF_STUNSETL_AVAILABLE                1
#define FM4_SDIF_STUNSTH_AVAILABLE                1
#define FM_SDIF_STUNSTH_AVAILABLE                 1
#define FM4_SDIF_STUNSTL_AVAILABLE                1
#define FM_SDIF_STUNSTL_AVAILABLE                 1
#define FM4_SDIF_SWKUPCTL_AVAILABLE               1
#define FM_SDIF_SWKUPCTL_AVAILABLE                1
/*******************************************************************************
* SWWDT
*******************************************************************************/
#define FM4_SWWDT_WDOGCONTROL_AVAILABLE           1
#define FM_SWWDT_WDOGCONTROL_AVAILABLE            1
#define FM4_SWWDT_WDOGINTCLR_AVAILABLE            1
#define FM_SWWDT_WDOGINTCLR_AVAILABLE             1
#define FM4_SWWDT_WDOGLOAD_AVAILABLE              1
#define FM_SWWDT_WDOGLOAD_AVAILABLE               1
#define FM4_SWWDT_WDOGLOCK_AVAILABLE              1
#define FM_SWWDT_WDOGLOCK_AVAILABLE               1
#define FM4_SWWDT_WDOGRIS_AVAILABLE               1
#define FM_SWWDT_WDOGRIS_AVAILABLE                1
#define FM4_SWWDT_WDOGSPMC_AVAILABLE              1
#define FM_SWWDT_WDOGSPMC_AVAILABLE               1
#define FM4_SWWDT_WDOGVALUE_AVAILABLE             1
#define FM_SWWDT_WDOGVALUE_AVAILABLE              1
/*******************************************************************************
* UNIQUE_ID
*******************************************************************************/
#define FM4_UNIQUE_ID_UIDR0_AVAILABLE             1
#define FM_UNIQUE_ID_UIDR0_AVAILABLE              1
#define FM4_UNIQUE_ID_UIDR1_AVAILABLE             1
#define FM_UNIQUE_ID_UIDR1_AVAILABLE              1
/*******************************************************************************
* WC
*******************************************************************************/
#define FM4_WC_CLK_EN_AVAILABLE                   1
#define FM_WC_CLK_EN_AVAILABLE                    1
#define FM4_WC_CLK_SEL_AVAILABLE                  1
#define FM_WC_CLK_SEL_AVAILABLE                   1
#define FM4_WC_WCCR_AVAILABLE                     1
#define FM_WC_WCCR_AVAILABLE                      1
#define FM4_WC_WCRD_AVAILABLE                     1
#define FM_WC_WCRD_AVAILABLE                      1
#define FM4_WC_WCRL_AVAILABLE                     1
#define FM_WC_WCRL_AVAILABLE                      1

