mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xj/common/s6e2c1xj.h
#define bFM_BT13_PWC_STC_OVIR                     *((volatile  uint8_t *)(0x424ACA00UL))
#define bFM4_BT13_PWC_STC_OVIR                    *((volatile  uint8_t *)(0x424ACA00UL))
#define bFM_BT13_PWC_STC_EDIR                     *((volatile  uint8_t *)(0x424ACA08UL))
#define bFM4_BT13_PWC_STC_EDIR                    *((volatile  uint8_t *)(0x424ACA08UL))
#define bFM_BT13_PWC_STC_OVIE                     *((volatile  uint8_t *)(0x424ACA10UL))
#define bFM4_BT13_PWC_STC_OVIE                    *((volatile  uint8_t *)(0x424ACA10UL))
#define bFM_BT13_PWC_STC_EDIE                     *((volatile  uint8_t *)(0x424ACA18UL))
#define bFM4_BT13_PWC_STC_EDIE                    *((volatile  uint8_t *)(0x424ACA18UL))
#define bFM_BT13_PWC_STC_ERR                      *((volatile  uint8_t *)(0x424ACA1CUL))
#define bFM4_BT13_PWC_STC_ERR                     *((volatile  uint8_t *)(0x424ACA1CUL))

#define bFM_BT13_PWC_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AC984UL))
#define bFM4_BT13_PWC_TMCR_CTEN                   *((volatile  uint8_t *)(0x424AC984UL))
#define bFM_BT13_PWC_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AC988UL))
#define bFM4_BT13_PWC_TMCR_MDSE                   *((volatile  uint8_t *)(0x424AC988UL))
#define bFM_BT13_PWC_TMCR_T32                     *((volatile  uint8_t *)(0x424AC99CUL))
#define bFM4_BT13_PWC_TMCR_T32                    *((volatile  uint8_t *)(0x424AC99CUL))

#define bFM_BT13_PWC_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424ACA20UL))
#define bFM4_BT13_PWC_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424ACA20UL))

#define bFM_BT13_PWM_STC_UDIR                     *((volatile  uint8_t *)(0x424ACA00UL))
#define bFM4_BT13_PWM_STC_UDIR                    *((volatile  uint8_t *)(0x424ACA00UL))
#define bFM_BT13_PWM_STC_DTIR                     *((volatile  uint8_t *)(0x424ACA04UL))
#define bFM4_BT13_PWM_STC_DTIR                    *((volatile  uint8_t *)(0x424ACA04UL))
#define bFM_BT13_PWM_STC_TGIR                     *((volatile  uint8_t *)(0x424ACA08UL))
#define bFM4_BT13_PWM_STC_TGIR                    *((volatile  uint8_t *)(0x424ACA08UL))
#define bFM_BT13_PWM_STC_UDIE                     *((volatile  uint8_t *)(0x424ACA10UL))
#define bFM4_BT13_PWM_STC_UDIE                    *((volatile  uint8_t *)(0x424ACA10UL))
#define bFM_BT13_PWM_STC_DTIE                     *((volatile  uint8_t *)(0x424ACA14UL))
#define bFM4_BT13_PWM_STC_DTIE                    *((volatile  uint8_t *)(0x424ACA14UL))
#define bFM_BT13_PWM_STC_TGIE                     *((volatile  uint8_t *)(0x424ACA18UL))
#define bFM4_BT13_PWM_STC_TGIE                    *((volatile  uint8_t *)(0x424ACA18UL))

#define bFM_BT13_PWM_TMCR_STRG                    *((volatile  uint8_t *)(0x424AC980UL))
#define bFM4_BT13_PWM_TMCR_STRG                   *((volatile  uint8_t *)(0x424AC980UL))
#define bFM_BT13_PWM_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AC984UL))
#define bFM4_BT13_PWM_TMCR_CTEN                   *((volatile  uint8_t *)(0x424AC984UL))
#define bFM_BT13_PWM_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AC988UL))
#define bFM4_BT13_PWM_TMCR_MDSE                   *((volatile  uint8_t *)(0x424AC988UL))
#define bFM_BT13_PWM_TMCR_OSEL                    *((volatile  uint8_t *)(0x424AC98CUL))
#define bFM4_BT13_PWM_TMCR_OSEL                   *((volatile  uint8_t *)(0x424AC98CUL))
#define bFM_BT13_PWM_TMCR_PMSK                    *((volatile  uint8_t *)(0x424AC9A8UL))
#define bFM4_BT13_PWM_TMCR_PMSK                   *((volatile  uint8_t *)(0x424AC9A8UL))
#define bFM_BT13_PWM_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424AC9ACUL))
#define bFM4_BT13_PWM_TMCR_RTGEN                  *((volatile  uint8_t *)(0x424AC9ACUL))

#define bFM_BT13_PWM_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424ACA20UL))
#define bFM4_BT13_PWM_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424ACA20UL))

#define bFM_BT13_RT_STC_UDIR                      *((volatile  uint8_t *)(0x424ACA00UL))
#define bFM4_BT13_RT_STC_UDIR                     *((volatile  uint8_t *)(0x424ACA00UL))
#define bFM_BT13_RT_STC_TGIR                      *((volatile  uint8_t *)(0x424ACA08UL))
#define bFM4_BT13_RT_STC_TGIR                     *((volatile  uint8_t *)(0x424ACA08UL))
#define bFM_BT13_RT_STC_UDIE                      *((volatile  uint8_t *)(0x424ACA10UL))
#define bFM4_BT13_RT_STC_UDIE                     *((volatile  uint8_t *)(0x424ACA10UL))
#define bFM_BT13_RT_STC_TGIE                      *((volatile  uint8_t *)(0x424ACA18UL))
#define bFM4_BT13_RT_STC_TGIE                     *((volatile  uint8_t *)(0x424ACA18UL))

#define bFM_BT13_RT_TMCR_STRG                     *((volatile  uint8_t *)(0x424AC980UL))
#define bFM4_BT13_RT_TMCR_STRG                    *((volatile  uint8_t *)(0x424AC980UL))
#define bFM_BT13_RT_TMCR_CTEN                     *((volatile  uint8_t *)(0x424AC984UL))
#define bFM4_BT13_RT_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AC984UL))
#define bFM_BT13_RT_TMCR_MDSE                     *((volatile  uint8_t *)(0x424AC988UL))
#define bFM4_BT13_RT_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AC988UL))
#define bFM_BT13_RT_TMCR_OSEL                     *((volatile  uint8_t *)(0x424AC98CUL))
#define bFM4_BT13_RT_TMCR_OSEL                    *((volatile  uint8_t *)(0x424AC98CUL))
#define bFM_BT13_RT_TMCR_T32                      *((volatile  uint8_t *)(0x424AC99CUL))
#define bFM4_BT13_RT_TMCR_T32                     *((volatile  uint8_t *)(0x424AC99CUL))

#define bFM_BT13_RT_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424ACA20UL))
#define bFM4_BT13_RT_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424ACA20UL))
#define bFM_BT13_RT_TMCR2_GATE                    *((volatile  uint8_t *)(0x424ACA3CUL))
#define bFM4_BT13_RT_TMCR2_GATE                   *((volatile  uint8_t *)(0x424ACA3CUL))


/*******************************************************************************
* BT Registers BT14
*   Bitband Section
*******************************************************************************/
#define bFM_BT14_PPG_STC_UDIR                     *((volatile  uint8_t *)(0x424AD200UL))
#define bFM4_BT14_PPG_STC_UDIR                    *((volatile  uint8_t *)(0x424AD200UL))
#define bFM_BT14_PPG_STC_TGIR                     *((volatile  uint8_t *)(0x424AD208UL))
#define bFM4_BT14_PPG_STC_TGIR                    *((volatile  uint8_t *)(0x424AD208UL))
#define bFM_BT14_PPG_STC_UDIE                     *((volatile  uint8_t *)(0x424AD210UL))
#define bFM4_BT14_PPG_STC_UDIE                    *((volatile  uint8_t *)(0x424AD210UL))
#define bFM_BT14_PPG_STC_TGIE                     *((volatile  uint8_t *)(0x424AD218UL))
#define bFM4_BT14_PPG_STC_TGIE                    *((volatile  uint8_t *)(0x424AD218UL))

