mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xj/common/s6e2c1xj.h
#define bFM_EXTI_NMICL_NCL                        *((volatile  uint8_t *)(0x42600300UL))
#define bFM4_EXTI_NMICL_NCL                       *((volatile  uint8_t *)(0x42600300UL))

#define bFM_EXTI_NMIRR_NR                         *((volatile  uint8_t *)(0x42600280UL))
#define bFM4_EXTI_NMIRR_NR                        *((volatile  uint8_t *)(0x42600280UL))


/*******************************************************************************
* FLASH_IF Registers FLASH_IF
*   Bitband Section
*******************************************************************************/
#define bFM_FLASH_IF_DFCTRLR_DFE                  *((volatile  uint32_t*)(0x42000600UL))
#define bFM4_FLASH_IF_DFCTRLR_DFE                 *((volatile  uint32_t*)(0x42000600UL))
#define bFM_FLASH_IF_DFCTRLR_RME                  *((volatile  uint32_t*)(0x42000604UL))
#define bFM4_FLASH_IF_DFCTRLR_RME                 *((volatile  uint32_t*)(0x42000604UL))

#define bFM_FLASH_IF_FBFCR_BE                     *((volatile  uint8_t *)(0x42000280UL))
#define bFM4_FLASH_IF_FBFCR_BE                    *((volatile  uint8_t *)(0x42000280UL))
#define bFM_FLASH_IF_FBFCR_BS                     *((volatile  uint8_t *)(0x42000284UL))
#define bFM4_FLASH_IF_FBFCR_BS                    *((volatile  uint8_t *)(0x42000284UL))

#define bFM_FLASH_IF_FICLR_RDYIC                  *((volatile  uint8_t *)(0x42000500UL))
#define bFM4_FLASH_IF_FICLR_RDYIC                 *((volatile  uint8_t *)(0x42000500UL))
#define bFM_FLASH_IF_FICLR_HNGIC                  *((volatile  uint8_t *)(0x42000504UL))
#define bFM4_FLASH_IF_FICLR_HNGIC                 *((volatile  uint8_t *)(0x42000504UL))
#define bFM_FLASH_IF_FICLR_ERRIC                  *((volatile  uint8_t *)(0x42000508UL))
#define bFM4_FLASH_IF_FICLR_ERRIC                 *((volatile  uint8_t *)(0x42000508UL))

#define bFM_FLASH_IF_FICR_RDYIE                   *((volatile  uint8_t *)(0x42000400UL))
#define bFM4_FLASH_IF_FICR_RDYIE                  *((volatile  uint8_t *)(0x42000400UL))
#define bFM_FLASH_IF_FICR_HNGIE                   *((volatile  uint8_t *)(0x42000404UL))
#define bFM4_FLASH_IF_FICR_HNGIE                  *((volatile  uint8_t *)(0x42000404UL))
#define bFM_FLASH_IF_FICR_ERRIE                   *((volatile  uint8_t *)(0x42000408UL))
#define bFM4_FLASH_IF_FICR_ERRIE                  *((volatile  uint8_t *)(0x42000408UL))

#define bFM_FLASH_IF_FISR_RDYIF                   *((volatile  uint8_t *)(0x42000480UL))
#define bFM4_FLASH_IF_FISR_RDYIF                  *((volatile  uint8_t *)(0x42000480UL))
#define bFM_FLASH_IF_FISR_HNGIF                   *((volatile  uint8_t *)(0x42000484UL))
#define bFM4_FLASH_IF_FISR_HNGIF                  *((volatile  uint8_t *)(0x42000484UL))
#define bFM_FLASH_IF_FISR_ERRIF                   *((volatile  uint8_t *)(0x42000488UL))
#define bFM4_FLASH_IF_FISR_ERRIF                  *((volatile  uint8_t *)(0x42000488UL))

#define bFM_FLASH_IF_FSTR_RDY                     *((volatile  uint8_t *)(0x42000100UL))
#define bFM4_FLASH_IF_FSTR_RDY                    *((volatile  uint8_t *)(0x42000100UL))
#define bFM_FLASH_IF_FSTR_HNG                     *((volatile  uint8_t *)(0x42000104UL))
#define bFM4_FLASH_IF_FSTR_HNG                    *((volatile  uint8_t *)(0x42000104UL))
#define bFM_FLASH_IF_FSTR_ERR                     *((volatile  uint8_t *)(0x42000108UL))
#define bFM4_FLASH_IF_FSTR_ERR                    *((volatile  uint8_t *)(0x42000108UL))


/*******************************************************************************
* GPIO Registers GPIO
*   Bitband Section
*******************************************************************************/
#define bFM_GPIO_ADE_AN00                         *((volatile  uint8_t *)(0x42DEA000UL))
#define bFM4_GPIO_ADE_AN00                        *((volatile  uint8_t *)(0x42DEA000UL))
#define bFM_GPIO_ADE_AN01                         *((volatile  uint8_t *)(0x42DEA004UL))
#define bFM4_GPIO_ADE_AN01                        *((volatile  uint8_t *)(0x42DEA004UL))
#define bFM_GPIO_ADE_AN02                         *((volatile  uint8_t *)(0x42DEA008UL))
#define bFM4_GPIO_ADE_AN02                        *((volatile  uint8_t *)(0x42DEA008UL))
#define bFM_GPIO_ADE_AN03                         *((volatile  uint8_t *)(0x42DEA00CUL))
#define bFM4_GPIO_ADE_AN03                        *((volatile  uint8_t *)(0x42DEA00CUL))
#define bFM_GPIO_ADE_AN04                         *((volatile  uint8_t *)(0x42DEA010UL))
#define bFM4_GPIO_ADE_AN04                        *((volatile  uint8_t *)(0x42DEA010UL))
#define bFM_GPIO_ADE_AN05                         *((volatile  uint8_t *)(0x42DEA014UL))
#define bFM4_GPIO_ADE_AN05                        *((volatile  uint8_t *)(0x42DEA014UL))
#define bFM_GPIO_ADE_AN06                         *((volatile  uint8_t *)(0x42DEA018UL))
#define bFM4_GPIO_ADE_AN06                        *((volatile  uint8_t *)(0x42DEA018UL))
#define bFM_GPIO_ADE_AN07                         *((volatile  uint8_t *)(0x42DEA01CUL))
#define bFM4_GPIO_ADE_AN07                        *((volatile  uint8_t *)(0x42DEA01CUL))
#define bFM_GPIO_ADE_AN08                         *((volatile  uint8_t *)(0x42DEA020UL))
#define bFM4_GPIO_ADE_AN08                        *((volatile  uint8_t *)(0x42DEA020UL))
#define bFM_GPIO_ADE_AN09                         *((volatile  uint8_t *)(0x42DEA024UL))
#define bFM4_GPIO_ADE_AN09                        *((volatile  uint8_t *)(0x42DEA024UL))
#define bFM_GPIO_ADE_AN10                         *((volatile  uint8_t *)(0x42DEA028UL))
#define bFM4_GPIO_ADE_AN10                        *((volatile  uint8_t *)(0x42DEA028UL))
#define bFM_GPIO_ADE_AN11                         *((volatile  uint8_t *)(0x42DEA02CUL))
#define bFM4_GPIO_ADE_AN11                        *((volatile  uint8_t *)(0x42DEA02CUL))
#define bFM_GPIO_ADE_AN12                         *((volatile  uint8_t *)(0x42DEA030UL))
#define bFM4_GPIO_ADE_AN12                        *((volatile  uint8_t *)(0x42DEA030UL))
#define bFM_GPIO_ADE_AN13                         *((volatile  uint8_t *)(0x42DEA034UL))
#define bFM4_GPIO_ADE_AN13                        *((volatile  uint8_t *)(0x42DEA034UL))
#define bFM_GPIO_ADE_AN14                         *((volatile  uint8_t *)(0x42DEA038UL))
#define bFM4_GPIO_ADE_AN14                        *((volatile  uint8_t *)(0x42DEA038UL))
#define bFM_GPIO_ADE_AN15                         *((volatile  uint8_t *)(0x42DEA03CUL))
#define bFM4_GPIO_ADE_AN15                        *((volatile  uint8_t *)(0x42DEA03CUL))
#define bFM_GPIO_ADE_AN16                         *((volatile  uint8_t *)(0x42DEA040UL))
#define bFM4_GPIO_ADE_AN16                        *((volatile  uint8_t *)(0x42DEA040UL))
#define bFM_GPIO_ADE_AN17                         *((volatile  uint8_t *)(0x42DEA044UL))
#define bFM4_GPIO_ADE_AN17                        *((volatile  uint8_t *)(0x42DEA044UL))
#define bFM_GPIO_ADE_AN18                         *((volatile  uint8_t *)(0x42DEA048UL))
#define bFM4_GPIO_ADE_AN18                        *((volatile  uint8_t *)(0x42DEA048UL))
#define bFM_GPIO_ADE_AN19                         *((volatile  uint8_t *)(0x42DEA04CUL))
#define bFM4_GPIO_ADE_AN19                        *((volatile  uint8_t *)(0x42DEA04CUL))
#define bFM_GPIO_ADE_AN20                         *((volatile  uint8_t *)(0x42DEA050UL))
#define bFM4_GPIO_ADE_AN20                        *((volatile  uint8_t *)(0x42DEA050UL))
#define bFM_GPIO_ADE_AN21                         *((volatile  uint8_t *)(0x42DEA054UL))
#define bFM4_GPIO_ADE_AN21                        *((volatile  uint8_t *)(0x42DEA054UL))
#define bFM_GPIO_ADE_AN22                         *((volatile  uint8_t *)(0x42DEA058UL))
#define bFM4_GPIO_ADE_AN22                        *((volatile  uint8_t *)(0x42DEA058UL))
#define bFM_GPIO_ADE_AN23                         *((volatile  uint8_t *)(0x42DEA05CUL))
#define bFM4_GPIO_ADE_AN23                        *((volatile  uint8_t *)(0x42DEA05CUL))
#define bFM_GPIO_ADE_AN24                         *((volatile  uint8_t *)(0x42DEA060UL))
#define bFM4_GPIO_ADE_AN24                        *((volatile  uint8_t *)(0x42DEA060UL))
#define bFM_GPIO_ADE_AN25                         *((volatile  uint8_t *)(0x42DEA064UL))
#define bFM4_GPIO_ADE_AN25                        *((volatile  uint8_t *)(0x42DEA064UL))
#define bFM_GPIO_ADE_AN26                         *((volatile  uint8_t *)(0x42DEA068UL))
#define bFM4_GPIO_ADE_AN26                        *((volatile  uint8_t *)(0x42DEA068UL))
#define bFM_GPIO_ADE_AN27                         *((volatile  uint8_t *)(0x42DEA06CUL))
#define bFM4_GPIO_ADE_AN27                        *((volatile  uint8_t *)(0x42DEA06CUL))
#define bFM_GPIO_ADE_AN28                         *((volatile  uint8_t *)(0x42DEA070UL))
#define bFM4_GPIO_ADE_AN28                        *((volatile  uint8_t *)(0x42DEA070UL))
#define bFM_GPIO_ADE_AN29                         *((volatile  uint8_t *)(0x42DEA074UL))
#define bFM4_GPIO_ADE_AN29                        *((volatile  uint8_t *)(0x42DEA074UL))
#define bFM_GPIO_ADE_AN30                         *((volatile  uint8_t *)(0x42DEA078UL))
#define bFM4_GPIO_ADE_AN30                        *((volatile  uint8_t *)(0x42DEA078UL))
#define bFM_GPIO_ADE_AN31                         *((volatile  uint8_t *)(0x42DEA07CUL))
#define bFM4_GPIO_ADE_AN31                        *((volatile  uint8_t *)(0x42DEA07CUL))

