mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xj/common/s6e2c1xj.h
#define bFM_GPIO_PFR2_P0                          *((volatile  uint8_t *)(0x42DE0100UL))
#define bFM4_GPIO_PFR2_P0                         *((volatile  uint8_t *)(0x42DE0100UL))
#define bFM_GPIO_PFR2_P1                          *((volatile  uint8_t *)(0x42DE0104UL))
#define bFM4_GPIO_PFR2_P1                         *((volatile  uint8_t *)(0x42DE0104UL))
#define bFM_GPIO_PFR2_P2                          *((volatile  uint8_t *)(0x42DE0108UL))
#define bFM4_GPIO_PFR2_P2                         *((volatile  uint8_t *)(0x42DE0108UL))
#define bFM_GPIO_PFR2_P3                          *((volatile  uint8_t *)(0x42DE010CUL))
#define bFM4_GPIO_PFR2_P3                         *((volatile  uint8_t *)(0x42DE010CUL))
#define bFM_GPIO_PFR2_P4                          *((volatile  uint8_t *)(0x42DE0110UL))
#define bFM4_GPIO_PFR2_P4                         *((volatile  uint8_t *)(0x42DE0110UL))
#define bFM_GPIO_PFR2_P5                          *((volatile  uint8_t *)(0x42DE0114UL))
#define bFM4_GPIO_PFR2_P5                         *((volatile  uint8_t *)(0x42DE0114UL))
#define bFM_GPIO_PFR2_P6                          *((volatile  uint8_t *)(0x42DE0118UL))
#define bFM4_GPIO_PFR2_P6                         *((volatile  uint8_t *)(0x42DE0118UL))
#define bFM_GPIO_PFR2_P7                          *((volatile  uint8_t *)(0x42DE011CUL))
#define bFM4_GPIO_PFR2_P7                         *((volatile  uint8_t *)(0x42DE011CUL))
#define bFM_GPIO_PFR2_P8                          *((volatile  uint8_t *)(0x42DE0120UL))
#define bFM4_GPIO_PFR2_P8                         *((volatile  uint8_t *)(0x42DE0120UL))
#define bFM_GPIO_PFR2_P9                          *((volatile  uint8_t *)(0x42DE0124UL))
#define bFM4_GPIO_PFR2_P9                         *((volatile  uint8_t *)(0x42DE0124UL))
#define bFM_GPIO_PFR2_PA                          *((volatile  uint8_t *)(0x42DE0128UL))
#define bFM4_GPIO_PFR2_PA                         *((volatile  uint8_t *)(0x42DE0128UL))

#define bFM_GPIO_PFR3_P0                          *((volatile  uint8_t *)(0x42DE0180UL))
#define bFM4_GPIO_PFR3_P0                         *((volatile  uint8_t *)(0x42DE0180UL))
#define bFM_GPIO_PFR3_P1                          *((volatile  uint8_t *)(0x42DE0184UL))
#define bFM4_GPIO_PFR3_P1                         *((volatile  uint8_t *)(0x42DE0184UL))
#define bFM_GPIO_PFR3_P2                          *((volatile  uint8_t *)(0x42DE0188UL))
#define bFM4_GPIO_PFR3_P2                         *((volatile  uint8_t *)(0x42DE0188UL))
#define bFM_GPIO_PFR3_P3                          *((volatile  uint8_t *)(0x42DE018CUL))
#define bFM4_GPIO_PFR3_P3                         *((volatile  uint8_t *)(0x42DE018CUL))
#define bFM_GPIO_PFR3_P4                          *((volatile  uint8_t *)(0x42DE0190UL))
#define bFM4_GPIO_PFR3_P4                         *((volatile  uint8_t *)(0x42DE0190UL))
#define bFM_GPIO_PFR3_P5                          *((volatile  uint8_t *)(0x42DE0194UL))
#define bFM4_GPIO_PFR3_P5                         *((volatile  uint8_t *)(0x42DE0194UL))
#define bFM_GPIO_PFR3_P6                          *((volatile  uint8_t *)(0x42DE0198UL))
#define bFM4_GPIO_PFR3_P6                         *((volatile  uint8_t *)(0x42DE0198UL))
#define bFM_GPIO_PFR3_P7                          *((volatile  uint8_t *)(0x42DE019CUL))
#define bFM4_GPIO_PFR3_P7                         *((volatile  uint8_t *)(0x42DE019CUL))
#define bFM_GPIO_PFR3_P8                          *((volatile  uint8_t *)(0x42DE01A0UL))
#define bFM4_GPIO_PFR3_P8                         *((volatile  uint8_t *)(0x42DE01A0UL))
#define bFM_GPIO_PFR3_P9                          *((volatile  uint8_t *)(0x42DE01A4UL))
#define bFM4_GPIO_PFR3_P9                         *((volatile  uint8_t *)(0x42DE01A4UL))
#define bFM_GPIO_PFR3_PA                          *((volatile  uint8_t *)(0x42DE01A8UL))
#define bFM4_GPIO_PFR3_PA                         *((volatile  uint8_t *)(0x42DE01A8UL))
#define bFM_GPIO_PFR3_PB                          *((volatile  uint8_t *)(0x42DE01ACUL))
#define bFM4_GPIO_PFR3_PB                         *((volatile  uint8_t *)(0x42DE01ACUL))
#define bFM_GPIO_PFR3_PC                          *((volatile  uint8_t *)(0x42DE01B0UL))
#define bFM4_GPIO_PFR3_PC                         *((volatile  uint8_t *)(0x42DE01B0UL))
#define bFM_GPIO_PFR3_PD                          *((volatile  uint8_t *)(0x42DE01B4UL))
#define bFM4_GPIO_PFR3_PD                         *((volatile  uint8_t *)(0x42DE01B4UL))
#define bFM_GPIO_PFR3_PE                          *((volatile  uint8_t *)(0x42DE01B8UL))
#define bFM4_GPIO_PFR3_PE                         *((volatile  uint8_t *)(0x42DE01B8UL))

#define bFM_GPIO_PFR4_P0                          *((volatile  uint8_t *)(0x42DE0200UL))
#define bFM4_GPIO_PFR4_P0                         *((volatile  uint8_t *)(0x42DE0200UL))
#define bFM_GPIO_PFR4_P1                          *((volatile  uint8_t *)(0x42DE0204UL))
#define bFM4_GPIO_PFR4_P1                         *((volatile  uint8_t *)(0x42DE0204UL))
#define bFM_GPIO_PFR4_P2                          *((volatile  uint8_t *)(0x42DE0208UL))
#define bFM4_GPIO_PFR4_P2                         *((volatile  uint8_t *)(0x42DE0208UL))
#define bFM_GPIO_PFR4_P3                          *((volatile  uint8_t *)(0x42DE020CUL))
#define bFM4_GPIO_PFR4_P3                         *((volatile  uint8_t *)(0x42DE020CUL))
#define bFM_GPIO_PFR4_P4                          *((volatile  uint8_t *)(0x42DE0210UL))
#define bFM4_GPIO_PFR4_P4                         *((volatile  uint8_t *)(0x42DE0210UL))
#define bFM_GPIO_PFR4_P5                          *((volatile  uint8_t *)(0x42DE0214UL))
#define bFM4_GPIO_PFR4_P5                         *((volatile  uint8_t *)(0x42DE0214UL))
#define bFM_GPIO_PFR4_P6                          *((volatile  uint8_t *)(0x42DE0218UL))
#define bFM4_GPIO_PFR4_P6                         *((volatile  uint8_t *)(0x42DE0218UL))
#define bFM_GPIO_PFR4_P7                          *((volatile  uint8_t *)(0x42DE021CUL))
#define bFM4_GPIO_PFR4_P7                         *((volatile  uint8_t *)(0x42DE021CUL))
#define bFM_GPIO_PFR4_P8                          *((volatile  uint8_t *)(0x42DE0220UL))
#define bFM4_GPIO_PFR4_P8                         *((volatile  uint8_t *)(0x42DE0220UL))
#define bFM_GPIO_PFR4_P9                          *((volatile  uint8_t *)(0x42DE0224UL))
#define bFM4_GPIO_PFR4_P9                         *((volatile  uint8_t *)(0x42DE0224UL))

#define bFM_GPIO_PFR5_P0                          *((volatile  uint8_t *)(0x42DE0280UL))
#define bFM4_GPIO_PFR5_P0                         *((volatile  uint8_t *)(0x42DE0280UL))
#define bFM_GPIO_PFR5_P1                          *((volatile  uint8_t *)(0x42DE0284UL))
#define bFM4_GPIO_PFR5_P1                         *((volatile  uint8_t *)(0x42DE0284UL))
#define bFM_GPIO_PFR5_P2                          *((volatile  uint8_t *)(0x42DE0288UL))
#define bFM4_GPIO_PFR5_P2                         *((volatile  uint8_t *)(0x42DE0288UL))
#define bFM_GPIO_PFR5_PD                          *((volatile  uint8_t *)(0x42DE02B4UL))
#define bFM4_GPIO_PFR5_PD                         *((volatile  uint8_t *)(0x42DE02B4UL))
#define bFM_GPIO_PFR5_PE                          *((volatile  uint8_t *)(0x42DE02B8UL))
#define bFM4_GPIO_PFR5_PE                         *((volatile  uint8_t *)(0x42DE02B8UL))
#define bFM_GPIO_PFR5_PF                          *((volatile  uint8_t *)(0x42DE02BCUL))
#define bFM4_GPIO_PFR5_PF                         *((volatile  uint8_t *)(0x42DE02BCUL))

