mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xj/common/s6e2c1xj.h
#define bFM_MFS9_LIN_ESCR_LBIE                    *((volatile  uint8_t *)(0x42712090UL))
#define bFM4_MFS9_LIN_ESCR_LBIE                   *((volatile  uint8_t *)(0x42712090UL))
#define bFM_MFS9_LIN_ESCR_ESBL                    *((volatile  uint8_t *)(0x42712098UL))
#define bFM4_MFS9_LIN_ESCR_ESBL                   *((volatile  uint8_t *)(0x42712098UL))

#define bFM_MFS9_LIN_FCR_FE1                      *((volatile  uint8_t *)(0x42712280UL))
#define bFM4_MFS9_LIN_FCR_FE1                     *((volatile  uint8_t *)(0x42712280UL))
#define bFM_MFS9_LIN_FCR_FE2                      *((volatile  uint8_t *)(0x42712284UL))
#define bFM4_MFS9_LIN_FCR_FE2                     *((volatile  uint8_t *)(0x42712284UL))
#define bFM_MFS9_LIN_FCR_FCL1                     *((volatile  uint8_t *)(0x42712288UL))
#define bFM4_MFS9_LIN_FCR_FCL1                    *((volatile  uint8_t *)(0x42712288UL))
#define bFM_MFS9_LIN_FCR_FCL2                     *((volatile  uint8_t *)(0x4271228CUL))
#define bFM4_MFS9_LIN_FCR_FCL2                    *((volatile  uint8_t *)(0x4271228CUL))
#define bFM_MFS9_LIN_FCR_FSET                     *((volatile  uint8_t *)(0x42712290UL))
#define bFM4_MFS9_LIN_FCR_FSET                    *((volatile  uint8_t *)(0x42712290UL))
#define bFM_MFS9_LIN_FCR_FLD                      *((volatile  uint8_t *)(0x42712294UL))
#define bFM4_MFS9_LIN_FCR_FLD                     *((volatile  uint8_t *)(0x42712294UL))
#define bFM_MFS9_LIN_FCR_FLST                     *((volatile  uint8_t *)(0x42712298UL))
#define bFM4_MFS9_LIN_FCR_FLST                    *((volatile  uint8_t *)(0x42712298UL))
#define bFM_MFS9_LIN_FCR_FSEL                     *((volatile  uint8_t *)(0x427122A0UL))
#define bFM4_MFS9_LIN_FCR_FSEL                    *((volatile  uint8_t *)(0x427122A0UL))
#define bFM_MFS9_LIN_FCR_FTIE                     *((volatile  uint8_t *)(0x427122A4UL))
#define bFM4_MFS9_LIN_FCR_FTIE                    *((volatile  uint8_t *)(0x427122A4UL))
#define bFM_MFS9_LIN_FCR_FDRQ                     *((volatile  uint8_t *)(0x427122A8UL))
#define bFM4_MFS9_LIN_FCR_FDRQ                    *((volatile  uint8_t *)(0x427122A8UL))
#define bFM_MFS9_LIN_FCR_FRIIE                    *((volatile  uint8_t *)(0x427122ACUL))
#define bFM4_MFS9_LIN_FCR_FRIIE                   *((volatile  uint8_t *)(0x427122ACUL))
#define bFM_MFS9_LIN_FCR_FLSTE                    *((volatile  uint8_t *)(0x427122B0UL))
#define bFM4_MFS9_LIN_FCR_FLSTE                   *((volatile  uint8_t *)(0x427122B0UL))

#define bFM_MFS9_LIN_SCR_TXE                      *((volatile  uint8_t *)(0x42712020UL))
#define bFM4_MFS9_LIN_SCR_TXE                     *((volatile  uint8_t *)(0x42712020UL))
#define bFM_MFS9_LIN_SCR_RXE                      *((volatile  uint8_t *)(0x42712024UL))
#define bFM4_MFS9_LIN_SCR_RXE                     *((volatile  uint8_t *)(0x42712024UL))
#define bFM_MFS9_LIN_SCR_TBIE                     *((volatile  uint8_t *)(0x42712028UL))
#define bFM4_MFS9_LIN_SCR_TBIE                    *((volatile  uint8_t *)(0x42712028UL))
#define bFM_MFS9_LIN_SCR_TIE                      *((volatile  uint8_t *)(0x4271202CUL))
#define bFM4_MFS9_LIN_SCR_TIE                     *((volatile  uint8_t *)(0x4271202CUL))
#define bFM_MFS9_LIN_SCR_RIE                      *((volatile  uint8_t *)(0x42712030UL))
#define bFM4_MFS9_LIN_SCR_RIE                     *((volatile  uint8_t *)(0x42712030UL))
#define bFM_MFS9_LIN_SCR_LBR                      *((volatile  uint8_t *)(0x42712034UL))
#define bFM4_MFS9_LIN_SCR_LBR                     *((volatile  uint8_t *)(0x42712034UL))
#define bFM_MFS9_LIN_SCR_MS                       *((volatile  uint8_t *)(0x42712038UL))
#define bFM4_MFS9_LIN_SCR_MS                      *((volatile  uint8_t *)(0x42712038UL))
#define bFM_MFS9_LIN_SCR_UPCL                     *((volatile  uint8_t *)(0x4271203CUL))
#define bFM4_MFS9_LIN_SCR_UPCL                    *((volatile  uint8_t *)(0x4271203CUL))

#define bFM_MFS9_LIN_SMR_SOE                      *((volatile  uint8_t *)(0x42712000UL))
#define bFM4_MFS9_LIN_SMR_SOE                     *((volatile  uint8_t *)(0x42712000UL))
#define bFM_MFS9_LIN_SMR_SBL                      *((volatile  uint8_t *)(0x4271200CUL))
#define bFM4_MFS9_LIN_SMR_SBL                     *((volatile  uint8_t *)(0x4271200CUL))
#define bFM_MFS9_LIN_SMR_WUCR                     *((volatile  uint8_t *)(0x42712010UL))
#define bFM4_MFS9_LIN_SMR_WUCR                    *((volatile  uint8_t *)(0x42712010UL))

#define bFM_MFS9_LIN_SSR_TBI                      *((volatile  uint8_t *)(0x427120A0UL))
#define bFM4_MFS9_LIN_SSR_TBI                     *((volatile  uint8_t *)(0x427120A0UL))
#define bFM_MFS9_LIN_SSR_TDRE                     *((volatile  uint8_t *)(0x427120A4UL))
#define bFM4_MFS9_LIN_SSR_TDRE                    *((volatile  uint8_t *)(0x427120A4UL))
#define bFM_MFS9_LIN_SSR_RDRF                     *((volatile  uint8_t *)(0x427120A8UL))
#define bFM4_MFS9_LIN_SSR_RDRF                    *((volatile  uint8_t *)(0x427120A8UL))
#define bFM_MFS9_LIN_SSR_ORE                      *((volatile  uint8_t *)(0x427120ACUL))
#define bFM4_MFS9_LIN_SSR_ORE                     *((volatile  uint8_t *)(0x427120ACUL))
#define bFM_MFS9_LIN_SSR_FRE                      *((volatile  uint8_t *)(0x427120B0UL))
#define bFM4_MFS9_LIN_SSR_FRE                     *((volatile  uint8_t *)(0x427120B0UL))
#define bFM_MFS9_LIN_SSR_LBD                      *((volatile  uint8_t *)(0x427120B4UL))
#define bFM4_MFS9_LIN_SSR_LBD                     *((volatile  uint8_t *)(0x427120B4UL))
#define bFM_MFS9_LIN_SSR_REC                      *((volatile  uint8_t *)(0x427120BCUL))
#define bFM4_MFS9_LIN_SSR_REC                     *((volatile  uint8_t *)(0x427120BCUL))

#define bFM_MFS9_UART_BGR_EXT                     *((volatile  uint8_t *)(0x427121BCUL))
#define bFM4_MFS9_UART_BGR_EXT                    *((volatile  uint8_t *)(0x427121BCUL))

#define bFM_MFS9_UART_ESCR_P                      *((volatile  uint8_t *)(0x4271208CUL))
#define bFM4_MFS9_UART_ESCR_P                     *((volatile  uint8_t *)(0x4271208CUL))
#define bFM_MFS9_UART_ESCR_PEN                    *((volatile  uint8_t *)(0x42712090UL))
#define bFM4_MFS9_UART_ESCR_PEN                   *((volatile  uint8_t *)(0x42712090UL))
#define bFM_MFS9_UART_ESCR_INV                    *((volatile  uint8_t *)(0x42712094UL))
#define bFM4_MFS9_UART_ESCR_INV                   *((volatile  uint8_t *)(0x42712094UL))
#define bFM_MFS9_UART_ESCR_ESBL                   *((volatile  uint8_t *)(0x42712098UL))
#define bFM4_MFS9_UART_ESCR_ESBL                  *((volatile  uint8_t *)(0x42712098UL))
#define bFM_MFS9_UART_ESCR_FLWEN                  *((volatile  uint8_t *)(0x4271209CUL))
#define bFM4_MFS9_UART_ESCR_FLWEN                 *((volatile  uint8_t *)(0x4271209CUL))

#define bFM_MFS9_UART_FCR_FE1                     *((volatile  uint8_t *)(0x42712280UL))
#define bFM4_MFS9_UART_FCR_FE1                    *((volatile  uint8_t *)(0x42712280UL))
#define bFM_MFS9_UART_FCR_FE2                     *((volatile  uint8_t *)(0x42712284UL))
#define bFM4_MFS9_UART_FCR_FE2                    *((volatile  uint8_t *)(0x42712284UL))
#define bFM_MFS9_UART_FCR_FCL1                    *((volatile  uint8_t *)(0x42712288UL))
#define bFM4_MFS9_UART_FCR_FCL1                   *((volatile  uint8_t *)(0x42712288UL))
#define bFM_MFS9_UART_FCR_FCL2                    *((volatile  uint8_t *)(0x4271228CUL))
#define bFM4_MFS9_UART_FCR_FCL2                   *((volatile  uint8_t *)(0x4271228CUL))
#define bFM_MFS9_UART_FCR_FSET                    *((volatile  uint8_t *)(0x42712290UL))
#define bFM4_MFS9_UART_FCR_FSET                   *((volatile  uint8_t *)(0x42712290UL))
#define bFM_MFS9_UART_FCR_FLD                     *((volatile  uint8_t *)(0x42712294UL))
#define bFM4_MFS9_UART_FCR_FLD                    *((volatile  uint8_t *)(0x42712294UL))
#define bFM_MFS9_UART_FCR_FLST                    *((volatile  uint8_t *)(0x42712298UL))
#define bFM4_MFS9_UART_FCR_FLST                   *((volatile  uint8_t *)(0x42712298UL))
#define bFM_MFS9_UART_FCR_FSEL                    *((volatile  uint8_t *)(0x427122A0UL))
#define bFM4_MFS9_UART_FCR_FSEL                   *((volatile  uint8_t *)(0x427122A0UL))
#define bFM_MFS9_UART_FCR_FTIE                    *((volatile  uint8_t *)(0x427122A4UL))
#define bFM4_MFS9_UART_FCR_FTIE                   *((volatile  uint8_t *)(0x427122A4UL))
#define bFM_MFS9_UART_FCR_FDRQ                    *((volatile  uint8_t *)(0x427122A8UL))
#define bFM4_MFS9_UART_FCR_FDRQ                   *((volatile  uint8_t *)(0x427122A8UL))
#define bFM_MFS9_UART_FCR_FRIIE                   *((volatile  uint8_t *)(0x427122ACUL))
#define bFM4_MFS9_UART_FCR_FRIIE                  *((volatile  uint8_t *)(0x427122ACUL))
#define bFM_MFS9_UART_FCR_FLSTE                   *((volatile  uint8_t *)(0x427122B0UL))
#define bFM4_MFS9_UART_FCR_FLSTE                  *((volatile  uint8_t *)(0x427122B0UL))

#define bFM_MFS9_UART_SCR_TXE                     *((volatile  uint8_t *)(0x42712020UL))
#define bFM4_MFS9_UART_SCR_TXE                    *((volatile  uint8_t *)(0x42712020UL))
#define bFM_MFS9_UART_SCR_RXE                     *((volatile  uint8_t *)(0x42712024UL))
#define bFM4_MFS9_UART_SCR_RXE                    *((volatile  uint8_t *)(0x42712024UL))
#define bFM_MFS9_UART_SCR_TBIE                    *((volatile  uint8_t *)(0x42712028UL))
#define bFM4_MFS9_UART_SCR_TBIE                   *((volatile  uint8_t *)(0x42712028UL))
#define bFM_MFS9_UART_SCR_TIE                     *((volatile  uint8_t *)(0x4271202CUL))
#define bFM4_MFS9_UART_SCR_TIE                    *((volatile  uint8_t *)(0x4271202CUL))
#define bFM_MFS9_UART_SCR_RIE                     *((volatile  uint8_t *)(0x42712030UL))
#define bFM4_MFS9_UART_SCR_RIE                    *((volatile  uint8_t *)(0x42712030UL))
#define bFM_MFS9_UART_SCR_UPCL                    *((volatile  uint8_t *)(0x4271203CUL))
#define bFM4_MFS9_UART_SCR_UPCL                   *((volatile  uint8_t *)(0x4271203CUL))

